Vadim139/ARM/STM32F429/LCD_7in/src/RA8875_Driver.c
 /******************************************************************************
  * @file    RA8875_Driver.c
  * @author  jason
  * @version V1.0.0
  * @date    3-June-2014
  * @brief   These functions are mainly to the operation of the RA8875:
  *           - Initialization and Configuration RA8875
  *           - Register read and write
	************************************************************************************/


#include "RA8875_Driver.h"
#include "stm32f4xx_fmc.h"
#include "stm32f4xx_conf.h"



/*******************************************************************************
* Function Name  : LCD_FSMCConfig
* Description    : Configures the Parallel interface (FSMC) for LCD(Parallel mode)
* Input          : None
* Output         : None
* Return         : None
* Attention		 : None
*******************************************************************************/
static void LCD_FSMCConfig(void)
{
	FMC_NORSRAMInitTypeDef  FMC_NORSRAMInitStructure;
	FMC_NORSRAMTimingInitTypeDef FMC_NORSRAMTimingInitStructure;
	
	FMC_NORSRAMInitStructure.FMC_Bank = FMC_Bank1_NORSRAM1;
	FMC_NORSRAMInitStructure.FMC_DataAddressMux = FMC_DataAddressMux_Disable;
	FMC_NORSRAMInitStructure.FMC_MemoryType = FMC_MemoryType_SRAM;
	FMC_NORSRAMInitStructure.FMC_MemoryDataWidth = FMC_NORSRAM_MemoryDataWidth_16b;
	FMC_NORSRAMInitStructure.FMC_BurstAccessMode = FMC_BurstAccessMode_Disable;
	FMC_NORSRAMInitStructure.FMC_WaitSignalPolarity = FMC_WaitSignalPolarity_Low;
	FMC_NORSRAMInitStructure.FMC_WrapMode = FMC_WrapMode_Disable;
	FMC_NORSRAMInitStructure.FMC_WaitSignalActive = FMC_WaitSignalActive_BeforeWaitState;
	FMC_NORSRAMInitStructure.FMC_WriteOperation = FMC_WriteOperation_Enable;
	FMC_NORSRAMInitStructure.FMC_WaitSignal = FMC_WaitSignal_Disable;
	FMC_NORSRAMInitStructure.FMC_AsynchronousWait = FMC_AsynchronousWait_Disable;
	FMC_NORSRAMInitStructure.FMC_ExtendedMode = FMC_ExtendedMode_Disable;
	FMC_NORSRAMInitStructure.FMC_WriteBurst = FMC_WriteBurst_Disable;
	FMC_NORSRAMInitStructure.FMC_ReadWriteTimingStruct = &FMC_NORSRAMTimingInitStructure;
	//FSMC_NORSRAMInit(&FSMC_NORSRAMInitStructure); 
	/* FSMC Write Timing */
	FMC_NORSRAMTimingInitStructure.FMC_AddressSetupTime = 15;//15;   /* Address Setup Time */
	FMC_NORSRAMTimingInitStructure.FMC_AddressHoldTime = 1;//1; 0 dla 168MHz
	FMC_NORSRAMTimingInitStructure.FMC_DataSetupTime = 15;//15	     /* Data Setup Time */
	FMC_NORSRAMTimingInitStructure.FMC_BusTurnAroundDuration = 0x00;
	FMC_NORSRAMTimingInitStructure.FMC_CLKDivision = 0x00;
	FMC_NORSRAMTimingInitStructure.FMC_DataLatency = 0x00;
	FMC_NORSRAMTimingInitStructure.FMC_AccessMode = FMC_AccessMode_A;	/* FSMC Access Mode */
	FMC_NORSRAMInitStructure.FMC_WriteTimingStruct = &FMC_NORSRAMTimingInitStructure;
	
	FMC_NORSRAMCmd(FMC_Bank1_NORSRAM1, ENABLE);

	FMC_NORSRAMInit(&FMC_NORSRAMInitStructure);
	
	/* Enable FSMC Bank4_SRAM Bank */
	FMC_NORSRAMCmd(FMC_Bank1_NORSRAM1, ENABLE);
}

static DMA_InitTypeDef DMA_InitStructure;

void LCD_PrepareDMA() {

	NVIC_InitTypeDef NVIC_InitStructure;

	// Enable DMA lock
	RCC_AHB1PeriphClockCmd( DMA_STREAM_CLOCK, ENABLE);

	// Reset DMA Stream registers (for debug purpose)
	DMA_DeInit( DMA_STREAM);
	DMA_Cmd(DMA_STREAM, DISABLE);
	DMA_StructInit(&DMA_InitStructure);

	// Configure DMA Stream
	DMA_InitStructure.DMA_Channel = DMA_CHANNEL;
	DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t) 0;
	DMA_InitStructure.DMA_Memory0BaseAddr = (uint32_t) (&(LCD_RAM));
	DMA_InitStructure.DMA_DIR = DMA_DIR_MemoryToMemory;
	DMA_InitStructure.DMA_BufferSize = 0;
	DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Enable;
	DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Disable;
	DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Word;
	DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Word;
	DMA_InitStructure.DMA_Mode = DMA_Mode_Normal;
	DMA_InitStructure.DMA_Priority = DMA_Priority_High;
	DMA_InitStructure.DMA_FIFOMode = DMA_FIFOMode_Disable;

	DMA_Init( DMA_STREAM, &DMA_InitStructure);

	// Enable DMA Stream Transfer Complete interrupt
	DMA_ITConfig( DMA_STREAM, DMA_IT_TC, ENABLE);

	// Enable the DMA Stream IRQ Channel
	NVIC_InitStructure.NVIC_IRQChannel = DMA_STREAM_IRQ;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);

	DMA_ClearITPendingBit( DMA_STREAM, DMA_STREAM_STATUS_BIT);

} // LCD_TransferDataDMA

/////////////////////////////////////////////////////////////

void DMA2_Stream7_IRQHandler(void) {

	// Test on DMA Stream Transfer Complete interrupt

	if (DMA_GetITStatus(DMA_STREAM, DMA_STREAM_STATUS_BIT) == SET) {

		// Clear DMA Stream Transfer Complete interrupt pending bit

		DMA_ClearITPendingBit( DMA_STREAM, DMA_STREAM_STATUS_BIT);
	}
}

void LCD_TransferDataDMA(void *buffer, uint32_t size)
{
	int parts = 0;
    if (size % 2 == 0)  {

    	size /= 2;

    	if(size>50000)
    	{
    		parts = size/50000;
    		parts++;

    		for(int i = 0;i < parts; i++)
    		{
    	    	while (DMA_STREAM->CR & DMA_SxCR_EN) { asm(""); }

    	    	DMA_STREAM->PAR = (uint32_t)(buffer + (i*200000));
    	    	if(i == parts-1)
    	    		DMA_SetCurrDataCounter(DMA_STREAM,(size-(i*50000)));//(size-((parts-i)*50000)));
    	    	else
        	        DMA_SetCurrDataCounter(DMA_STREAM,50000);//(size-((parts-i)*50000)));
    	    	DMA_Cmd(DMA_STREAM, ENABLE);               //Enable the DMA stream

//    	    	while (DMA_STREAM->CR & DMA_SxCR_EN) { asm(""); }

//    	    	DMA_STREAM->PAR = (uint32_t)(buffer+200000);// + (i*100000));
//    	        DMA_SetCurrDataCounter(DMA_STREAM,25000);//(size-((parts-i)*50000)));
//    	        DMA_Cmd(DMA_STREAM, ENABLE);               //Enable the DMA stream
    		}
    	}else{
    		    	while (DMA_STREAM->CR & DMA_SxCR_EN) { asm(""); }

    		    	DMA_STREAM->PAR = (uint32_t)buffer;
    		        DMA_SetCurrDataCounter(DMA_STREAM,size);
    		        DMA_Cmd(DMA_STREAM, ENABLE);               //Enable the DMA stream
    	}

//    	while (DMA_STREAM->CR & DMA_SxCR_EN) { asm(""); }
//
//    	DMA_STREAM->PAR = (uint32_t)buffer;
//        DMA_SetCurrDataCounter(DMA_STREAM,size);
//        DMA_Cmd(DMA_STREAM, ENABLE);               //Enable the DMA stream

