Vadim139/ARM/STM32F429/LCD_7in/src/RA8875_Driver.c
    }

}

inline void LCD_OpenBulkWrite(u16 x, u16 width, u16 y, u16 height) {

	Active_Window(x, x + width - 1, y, y + height - 1);
	XY_Coordinate(x, y);
	LCD_CmdWrite(LCD_MRWC);
}

inline void LCD_BulkWrite(uint16_t* pixel, uint32_t len) {

	LCD_TransferDataDMA((uint16_t*) pixel, len);
}

inline void LCD_CloseBulkWrite(void) {

	while (DMA_STREAM->CR & DMA_SxCR_EN) { asm(""); }
	Active_Window(0, 799, 0, 479);
	Chk_Busy();
	LCD_CmdWrite(LCD_MWCR0);
	LCD_DataWrite(0);
//	LCD_SendRegister(LCD_MWCR0, 0);
}

uint16_t VU_HEIGHT = 480;
uint16_t VU_WIDE = 800;

uint16_t VUPOS_X = 0;
uint16_t VUPOS_Y = 0;

void LCD_drawVU(uint16_t* img) {

	LCD_OpenBulkWrite(VUPOS_X, VU_WIDE, VUPOS_Y, VU_HEIGHT);

	LCD_BulkWrite((uint16_t*) img, (VU_WIDE * VU_HEIGHT));

	LCD_CloseBulkWrite();

}

uint16_t V1_X = 321;
uint16_t V1_Y = 0;

void LCD_draw1(uint16_t* img) {

	LCD_OpenBulkWrite(V1_X, VU_WIDE, V1_Y, VU_HEIGHT);

	LCD_BulkWrite(img, (VU_WIDE * VU_HEIGHT));

	LCD_CloseBulkWrite();

}

uint16_t V2_X = 0;
uint16_t V2_Y = 241;

void LCD_draw2(uint16_t* img) {

	LCD_OpenBulkWrite(V2_X, VU_WIDE, V2_Y, VU_HEIGHT);

	LCD_BulkWrite(img, (VU_WIDE * VU_HEIGHT));

	LCD_CloseBulkWrite();

}

uint16_t V3_X = 321;
uint16_t V3_Y = 241;

void LCD_draw3(uint16_t* img) {

	LCD_OpenBulkWrite(V3_X, VU_WIDE, V3_Y, VU_HEIGHT);

	LCD_BulkWrite(img, (VU_WIDE * VU_HEIGHT));

	LCD_CloseBulkWrite();

}

/*******************************************************************************
* Function Name  : LCD_CtrlLinesConfig
* Description    : Configures LCD Control lines (FSMC Pins) in alternate function
                   Push-Pull mode.
* Input          : None
* Output         : None
* Return         : None
* Attention		   : None
*******************************************************************************/
static void LCD_CtrlLinesConfig(void)
{
	GPIO_InitTypeDef GPIO_InitStructure; 
	
	/* Enable GPIOs clock */
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOD | RCC_AHB1Periph_GPIOE | RCC_AHB1Periph_GPIOG, ENABLE);
	
	/* Enable FSMC clock */
	RCC_AHB3PeriphClockCmd(RCC_AHB3Periph_FMC, ENABLE);

	/*-- GPIOs Configuration ------------------------------------------------------*/
	/*
	+-------------------+--------------------+------------------+------------------+
	+                       SRAM pins assignment                                   +
	+-------------------+--------------------+------------------+------------------+
	| PD0  <-> FSMC_D2  | //PE2  <-> FSMC_A23  | //PG5 <-> FSMC_A15	|
	| PD1  <-> FSMC_D3  |                    |// PG12<-> FSMC_NE4 |
	| PD4  <-> FSMC_NOE | PE7  <-> FSMC_D4   | //PG13<-> FSMC_A24 |
	| PD5  <-> FSMC_NWE | PE8  <-> FSMC_D5   |------------------+ 
	| PD8  <-> FSMC_D13 | PE9  <-> FSMC_D6   | PG6 wait
	| PD9  <-> FSMC_D14 | PE10 <-> FSMC_D7   | PD6 int
	| PD10 <-> FSMC_D15 | PE11 <-> FSMC_D8   | 
	|                   | PE12 <-> FSMC_D9   | 
	|                   | PE13 <-> FSMC_D10  |                   
	| PD14 <-> FSMC_D0  | PE14 <-> FSMC_D11  |                  
	| PD15 <-> FSMC_D1  | PE15 <-> FSMC_D12  |
	+-------------------+--------------------+
	*/
	/* GPIOD configuration */
	GPIO_PinAFConfig(GPIOD, GPIO_PinSource0, GPIO_AF_FMC);
	GPIO_PinAFConfig(GPIOD, GPIO_PinSource1, GPIO_AF_FMC);
	GPIO_PinAFConfig(GPIOD, GPIO_PinSource4, GPIO_AF_FMC);
	GPIO_PinAFConfig(GPIOD, GPIO_PinSource5, GPIO_AF_FMC);
	GPIO_PinAFConfig(GPIOD, GPIO_PinSource6, GPIO_AF_FMC);
	GPIO_PinAFConfig(GPIOD, GPIO_PinSource7, GPIO_AF_FMC);
	GPIO_PinAFConfig(GPIOD, GPIO_PinSource8, GPIO_AF_FMC);
	GPIO_PinAFConfig(GPIOD, GPIO_PinSource9, GPIO_AF_FMC);
	GPIO_PinAFConfig(GPIOD, GPIO_PinSource10, GPIO_AF_FMC);
	GPIO_PinAFConfig(GPIOD, GPIO_PinSource11, GPIO_AF_FMC);
	GPIO_PinAFConfig(GPIOD, GPIO_PinSource14, GPIO_AF_FMC);
	GPIO_PinAFConfig(GPIOD, GPIO_PinSource15, GPIO_AF_FMC);
	
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_4 | GPIO_Pin_5 | GPIO_Pin_6 | GPIO_Pin_7 |
	                            GPIO_Pin_8 | GPIO_Pin_9 | GPIO_Pin_10 | GPIO_Pin_11 | GPIO_Pin_14 | GPIO_Pin_15;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	GPIO_InitStructure.GPIO_PuPd  = GPIO_PuPd_NOPULL;
	
	GPIO_Init(GPIOD, &GPIO_InitStructure);
	
	
	/* GPIOE configuration */
//	GPIO_PinAFConfig(GPIOE, GPIO_PinSource2 , GPIO_AF_FSMC);
	GPIO_PinAFConfig(GPIOE, GPIO_PinSource7 , GPIO_AF_FMC);
	GPIO_PinAFConfig(GPIOE, GPIO_PinSource8 , GPIO_AF_FMC);
	GPIO_PinAFConfig(GPIOE, GPIO_PinSource9 , GPIO_AF_FMC);
	GPIO_PinAFConfig(GPIOE, GPIO_PinSource10 , GPIO_AF_FMC);
	GPIO_PinAFConfig(GPIOE, GPIO_PinSource11 , GPIO_AF_FMC);
	GPIO_PinAFConfig(GPIOE, GPIO_PinSource12 , GPIO_AF_FMC);
	GPIO_PinAFConfig(GPIOE, GPIO_PinSource13 , GPIO_AF_FMC);
	GPIO_PinAFConfig(GPIOE, GPIO_PinSource14 , GPIO_AF_FMC);
	GPIO_PinAFConfig(GPIOE, GPIO_PinSource15 , GPIO_AF_FMC);
	
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_7 | GPIO_Pin_8  | GPIO_Pin_9  | GPIO_Pin_10 |
	                             GPIO_Pin_11| GPIO_Pin_12 | GPIO_Pin_13 | GPIO_Pin_14 | GPIO_Pin_15;
	
	GPIO_Init(GPIOE, &GPIO_InitStructure);
	

	/* GPIOG configuration */
	GPIO_PinAFConfig(GPIOG, GPIO_PinSource6 , GPIO_AF_FMC);
//	GPIO_PinAFConfig(GPIOG, GPIO_PinSource12 , GPIO_AF_FSMC);
//	GPIO_PinAFConfig(GPIOG, GPIO_PinSource13 , GPIO_AF_FSMC);

	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6; //| GPIO_Pin_13 | GPIO_Pin_12;

	GPIO_Init(GPIOG, &GPIO_InitStructure);
}


/*******************************************************************************
* Function Name  : LCD_Configuration
* Description    : Configure the LCD Control pins and FSMC Parallel interface
* Input          : None
* Output         : None
* Return         : None
* Attention		 : None
*******************************************************************************/
static void LCD_Configuration(void)
{
	/* Configure the LCD Control pins --------------------------------------------*/
	LCD_CtrlLinesConfig();
	
	/* Configure the FSMC Parallel interface -------------------------------------*/
	LCD_FSMCConfig();
}


