Vadim139/ARM/STM32F429/LCD_7in/src/RA8875_Driver.c
/*******************************************************************************
* Function Name  : LCD_CtrlLinesConfig
* Description    : Configures LCD Control lines (FSMC Pins) in alternate function
                   Push-Pull mode.
* Input          : None
* Output         : None
* Return         : None
* Attention		 : None
*******************************************************************************/

static inline void LCD_SendCommand(uint16_t cmd) {
	LCD_REG = cmd;
}
static inline void LCD_SendData(uint16_t data) {
	LCD_RAM = data;
}

static inline void LCD_SendRegister(uint16_t cmd, uint16_t data) {
	Chk_Busy();
	LCD_REG = cmd;
	LCD_RAM = data;
}



void LCD_Initializtion(void)
{
	LCD_Configuration();	
	delay_ms(10);

	RA8875_PLL_ini();
	LCD_CmdWrite(0x10);  //SYSR   uint8_t[4:3]=00 256 color  uint8_t[2:1]=  00 8bit MPU interface
  LCD_DataWrite(0x0c);   // if 8bit MCU interface   and 65k color display  						    
    //LCD_DataWrite(0x0F); // if 16bit MCU interface   and 65k color display  

#ifdef P800x480
//AT070TN92  setting
//==============	Display Window	800x480 ==================	
   /*
   LCD_CmdWrite(0x04);     //PCLK inverse
   LCD_DataWrite(0x81);
   Delay1ms(1);
   
   //Horizontal set
   LCD_CmdWrite(0x14); //HDWR//Horizontal Display Width Setting uint8_t[6:0]                   
   LCD_DataWrite(0x63);//Horizontal display width(pixels) = (HDWR + 1)*8                   
   LCD_CmdWrite(0x15); //Horizontal Non-Display Period Fine Tuning Option Register (HNDFTR)
   //LCD_DataWrite(0x03);//Horizontal Non-Display Period Fine Tuning(HNDFT) [3:0] 
   LCD_DataWrite(0x02);
   
   LCD_CmdWrite(0x16); //HNDR//Horizontal Non-Display Period uint8_t[4:0]                      
   //LCD_DataWrite(0x03);//Horizontal Non-Display Period (pixels) = (HNDR + 1)*8   
   LCD_DataWrite(0x04);
   
   LCD_CmdWrite(0x17); //HSTR//HSYNC Start Position[4:0]                                   
   //LCD_DataWrite(0x02);//HSYNC Start Position(PCLK) = (HSTR + 1)*8    
   LCD_DataWrite(0x18);
   
   LCD_CmdWrite(0x18); //HPWR//HSYNC Polarity ,The period width of HSYNC.                  
   LCD_DataWrite(0x00);//HSYNC Width [4:0]   HSYNC Pulse width(PCLK) = (HPWR + 1)*8     
   //Vertical set    
   LCD_CmdWrite(0x19); //VDHR0 //Vertical Display Height uint8_t [7:0]                         
   LCD_DataWrite(0xdf);//Vertical pixels = VDHR + 1                                        
   LCD_CmdWrite(0x1a); //VDHR1 //Vertical Display Height uint8_t [8]                           
   LCD_DataWrite(0x01);//Vertical pixels = VDHR + 1        
   
   LCD_CmdWrite(0x1b); //VNDR0 //Vertical Non-Display Period uint8_t [7:0]                     
   //LCD_DataWrite(0x14);//Vertical Non-Display area = (VNDR + 1) 
   LCD_DataWrite(0x17);
   
   LCD_CmdWrite(0x1c); //VNDR1 //Vertical Non-Display Period uint8_t [8]                       
   LCD_DataWrite(0x00);//Vertical Non-Display area = (VNDR + 1)   
   
   LCD_CmdWrite(0x1d); //VSTR0 //VSYNC Start Position[7:0]                                 
   //LCD_DataWrite(0x06);//VSYNC Start Position(PCLK) = (VSTR + 1)  
   LCD_DataWrite(0x16);
   
   LCD_CmdWrite(0x1e); //VSTR1 //VSYNC Start Position[8]                                   
   LCD_DataWrite(0x00);//VSYNC Start Position(PCLK) = (VSTR + 1)                           
   LCD_CmdWrite(0x1f); //VPWR //VSYNC Polarity ,VSYNC Pulse Width[6:0]                     
   LCD_DataWrite(0x01);//VSYNC Pulse Width(PCLK) = (VPWR + 1)                              
   */
 //LCD_CmdWrite(0xf2);  
 //LCD_DataWrite(0x01);
   
//HSD050IDW1 setting
//==============	Display Window	800x480 ==================	
 
   LCD_CmdWrite(0x04);  //PCLK inverse
   LCD_DataWrite(0x81);
   delay_ms(1);
 
   //Horizontal set
   LCD_CmdWrite(0x14); //HDWR//Horizontal Display Width Setting Bit[6:0]                      
   LCD_DataWrite(0x63);//Horizontal display width(pixels) = (HDWR + 1)*8                      
   LCD_CmdWrite(0x15);//Horizontal Non-Display Period Fine Tuning Option Register (HNDFTR)   
   LCD_DataWrite(0x00);//Horizontal Non-Display Period Fine Tuning(HNDFT) [3:0]               
   LCD_CmdWrite(0x16); //HNDR//Horizontal Non-Display Period Bit[4:0]                         
   LCD_DataWrite(0x03);//Horizontal Non-Display Period (pixels) = (HNDR + 1)*8                
   LCD_CmdWrite(0x17); //HSTR//HSYNC Start Position[4:0]                                      
   LCD_DataWrite(0x03);//HSYNC Start Position(PCLK) = (HSTR + 1)*8                            
   LCD_CmdWrite(0x18); //HPWR//HSYNC Polarity ,The period width of HSYNC.                     
   LCD_DataWrite(0x0B);//HSYNC Width [4:0]   HSYNC Pulse width(PCLK) = (HPWR + 1)*8    
   //Vertical set                             
   LCD_CmdWrite(0x19); //VDHR0 //Vertical Display Height Bit [7:0]                            
   LCD_DataWrite(0xdf);//Vertical pixels = VDHR + 1                                           
   LCD_CmdWrite(0x1a); //VDHR1 //Vertical Display Height Bit [8]                              
   LCD_DataWrite(0x01);//Vertical pixels = VDHR + 1                                           
   LCD_CmdWrite(0x1b); //VNDR0 //Vertical Non-Display Period Bit [7:0]                        
   LCD_DataWrite(0x20);//Vertical Non-Display area = (VNDR + 1)                               
   LCD_CmdWrite(0x1c); //VNDR1 //Vertical Non-Display Period Bit [8]                          
   LCD_DataWrite(0x00);//Vertical Non-Display area = (VNDR + 1)                               
   LCD_CmdWrite(0x1d); //VSTR0 //VSYNC Start Position[7:0]                                    
   LCD_DataWrite(0x16);//VSYNC Start Position(PCLK) = (VSTR + 1)                              
   LCD_CmdWrite(0x1e); //VSTR1 //VSYNC Start Position[8]                                      
   LCD_DataWrite(0x00);//VSYNC Start Position(PCLK) = (VSTR + 1)                              
   LCD_CmdWrite(0x1f); //VPWR //VSYNC Polarity ,VSYNC Pulse Width[6:0]                        
   LCD_DataWrite(0x01);//VSYNC Pulse Width(PCLK) = (VPWR + 1                               
 
   //Active window  set 
   //setting active window X
    LCD_CmdWrite(0x30); //Horizontal Start Point 0 of Active Window (HSAW0)
    LCD_DataWrite(0x00); //Horizontal Start Point of Active Window [7:0]
    LCD_CmdWrite(0x31); //Horizontal Start Point 1 of Active Window (HSAW1)	   
    LCD_DataWrite(0x00); //Horizontal Start Point of Active Window [9:8]
    LCD_CmdWrite(0x34); //Horizontal End Point 0 of Active Window (HEAW0)
    LCD_DataWrite(0x1F); //Horizontal End Point of Active Window [7:0]
    LCD_CmdWrite(0x35); //Horizontal End Point 1 of Active Window (HEAW1)	   
    LCD_DataWrite(0x03); //Horizontal End Point of Active Window [9:8]
  
   //setting active window Y
    LCD_CmdWrite(0x32); //Vertical Start Point 0 of Active Window (VSAW0)
    LCD_DataWrite(0x00); //Vertical Start Point of Active Window [7:0]
    LCD_CmdWrite(0x33); //Vertical Start Point 1 of Active Window (VSAW1)	   
    LCD_DataWrite(0x00); //Vertical Start Point of Active Window [8]
    LCD_CmdWrite(0x36); //Vertical End Point of Active Window 0 (VEAW0)
    LCD_DataWrite(0xdf); //Vertical End Point of Active Window [7:0]
    LCD_CmdWrite(0x37); //Vertical End Point of Active Window 1 (VEAW1)	   
    LCD_DataWrite(0x01); //Vertical End Point of Active Window [8]
		
		//backlight on for RAiO RA8875_demo_board_V2
		PWM1_enable();
		PWM1_fnuction_sel();
		PWM1_clock_ratio(0x05); //bit0~3     
		PWM1_duty_cycle(0x05); // 




