Vadim139/ARM/STM32F429/LCD_7in/src/RA8875_Driver.c
		////////////////

		/* Software reset the LCD */
			LCD_SendRegister(LCD_PWRR, 0x01);
			_delay_ms(10);
			LCD_SendRegister(LCD_PWRR, 0x00);
			_delay_ms(10);
			LCD_SendRegister(LCD_PLLC1, 0x0a);
			_delay_ms(10);
			LCD_SendRegister(LCD_PLLC2, 0x02);
			_delay_ms(10);

			LCD_SendCommand(0x10);	 //SYSR   bit[4:3] color  bit[2:1]=  MPU interface

			LCD_SendData(0x0F);   //            65K 16 bit 8080 mpu interface

			LCD_SendCommand(LCD_PCSR);    //PCLK
			LCD_SendData(0x80);   // 00b: PCLK period = System Clock period.
			_delay_ms(10);

			//Horizontal set
			LCD_SendCommand(0x14); //HDWR//Horizontal Display Width Setting Bit[6:0]
			LCD_SendData(0x63); //Horizontal display width(pixels) = (HDWR + 1)*8
			LCD_SendCommand(0x15); //Horizontal Non-Display Period Fine Tuning Option Register (HNDFTR)
			LCD_SendData(0x00); //Horizontal Non-Display Period Fine Tuning(HNDFT) [3:0]
			LCD_SendCommand(0x16); //HNDR//Horizontal Non-Display Period Bit[4:0]
			LCD_SendData(0x03); //Horizontal Non-Display Period (pixels) = (HNDR + 1)*8
			LCD_SendCommand(0x17); //HSTR//HSYNC Start Position[4:0]
			LCD_SendData(0x03); //HSYNC Start Position(PCLK) = (HSTR + 1)*8
			LCD_SendCommand(0x18); //HPWR//HSYNC Polarity ,The period width of HSYNC.
			LCD_SendData(0x0B); //HSYNC Width [4:0]   HSYNC Pulse width(PCLK) = (HPWR + 1)*8
			//Vertical set
			LCD_SendCommand(0x19); //VDHR0 //Vertical Display Height Bit [7:0]
			LCD_SendData(0xdf); //Vertical pixels = VDHR + 1
			LCD_SendCommand(0x1a); //VDHR1 //Vertical Display Height Bit [8]
			LCD_SendData(0x01); //Vertical pixels = VDHR + 1
			LCD_SendCommand(0x1b); //VNDR0 //Vertical Non-Display Period Bit [7:0]
			LCD_SendData(0x20); //Vertical Non-Display area = (VNDR + 1)
			LCD_SendCommand(0x1c); //VNDR1 //Vertical Non-Display Period Bit [8]
			LCD_SendData(0x00); //Vertical Non-Display area = (VNDR + 1)
			LCD_SendCommand(0x1d); //VSTR0 //VSYNC Start Position[7:0]
			LCD_SendData(0x16); //VSYNC Start Position(PCLK) = (VSTR + 1)
			LCD_SendCommand(0x1e); //VSTR1 //VSYNC Start Position[8]
			LCD_SendData(0x00); //VSYNC Start Position(PCLK) = (VSTR + 1)
			LCD_SendCommand(0x1f); //VPWR //VSYNC Polarity ,VSYNC Pulse Width[6:0]
			LCD_SendData(0x01); //VSYNC Pulse Width(PCLK) = (VPWR + 1)

			Active_Window(0, 799, 0, 479);

			LCD_SendCommand(0x8a); //PWM setting
			LCD_SendData(0x80);
			LCD_SendCommand(0x8a); //PWM setting
			LCD_SendData(0x81); //open PWM
			LCD_SendCommand(0x8b); //Backlight brightness setting
			LCD_SendData(0x1f); //Brightness parameter 0xff-0x00

			LCD_SendRegister(0X01, 0X80); //display on


			LcdClear(0);

		LCD_SendRegister(LCD_MCLR, 0x80);
#endif     
}


/*******************************************************************************
* Function Name  : RA8875_PLL_ini
* Description    : Initialization RA8875 system clock
* Input          : None
* Output         : None
* Return         : None
* Attention		   : None
*******************************************************************************/
void RA8875_PLL_ini(void)
{
#ifdef P320x240
    LCD_CmdWrite(0x88);    
    LCD_DataWrite(0x0a);
    delay_ms(1);
    LCD_CmdWrite(0x89);
    LCD_DataWrite(0x02);       
    delay_ms(1);
#endif

#ifdef P480x272
    LCD_CmdWrite(0x88);      
    LCD_DataWrite(0x0a);
    delay_ms(1);     
    LCD_CmdWrite(0x89);        
    LCD_DataWrite(0x02);  
    delay_ms(1);
#endif

#ifdef P640x480
    LCD_CmdWrite(0x88);    
    LCD_DataWrite(0x8b);
    delay_ms(1);    
    LCD_CmdWrite(0x89);        
    LCD_DataWrite(0x02);     
    delay_ms(1);
#endif

#ifdef P800x480
    LCD_CmdWrite(0x88);       
    LCD_DataWrite(0x86);
    //LCD_DataWrite(0x14);
    delay_ms(1);    
    LCD_CmdWrite(0x89);       
    LCD_DataWrite(0x0);  
    delay_ms(1);
#endif
    Software_Reset();
    delay_ms(5);
}	



/*******************************************************************************
* Function Name  : Chk_Busy
* Description    : Check whether the Memory Read/Write is busy
* Input          : None
* Output         : None
* Return         : None
* Attention		   : None
*******************************************************************************/
void Chk_Busy(void)
{
	uint8_t temp; 	
	do
	{
	  temp=LCD_StatusRead();
	}while((temp&0x80)==0x80);	   
}

/*******************************************************************************
* Function Name  : Chk_Busy_BTE
* Description    : Check whether the BTE is busy
* Input          : None
* Output         : None
* Return         : None
* Attention		   : None
*******************************************************************************/
void Chk_Busy_BTE(void)
{
	uint8_t temp;  	
	do
	{
          temp=LCD_StatusRead();
	}while((temp&0x40)==0x40);	   
}
/*******************************************************************************
* Function Name  : Chk_Busy_DIR_Access
* Description    : Check whether the DIR_Access is busy
* Input          : None
* Output         : None
* Return         : None
* Attention		   : None
*******************************************************************************/
void Chk_Busy_DIR_Access(void)
{
	uint8_t  temp;	
	do
	{
          temp=LCD_StatusRead();
	}while((temp&0x01)==0x01);	   
}

/*******************************************************************************
* Function Name  : Chk_DMA_Busy
* Description    : Check whether the DMA is busy
* Input          : None
* Output         : None
* Return         : None
* Attention		   : None
*******************************************************************************/
void Chk_DMA_Busy(void)
{
	uint8_t temp; 	
	do
	{
	LCD_CmdWrite(0xBF);
	temp = LCD_DataRead();
	}while((temp&0x01)==0x01);   
}

/*******************************************************************************
* Function Name  : Display_ON
* Description    : Display on
* Input          : None
* Output         : None
* Return         : None
* Attention		   : None
*******************************************************************************/		 
void Display_ON(void)
{	
    LCD_CmdWrite(0x01);//PWRR
    LCD_DataWrite(0x80);
}
/*******************************************************************************
* Function Name  : Display_OFF
* Description    : Display OFF 
* Input          : None
* Output         : None
* Return         : None
* Attention		   : None
*******************************************************************************/
void Display_OFF(void)
{
    LCD_CmdWrite(0x01);//PWRR
    LCD_DataWrite(0x00);
}
/*******************************************************************************
* Function Name  : Normal_Mode_exitSleep
* Description    : Normal mode
* Input          : None
* Output         : None
* Return         : None
* Attention		   : 1. There are 3 ways to wake up from sleep mode:  
											Touch Panel wake up, Key Scan wake up ,Software wake up. 
									 2. When using IIC interface, this function is not supported. 
*******************************************************************************/
void Normal_Mode_exitSleep(void)
{	
    LCD_CmdWrite(0x01);//PWRR
    LCD_DataWrite(0x00);
}
/*******************************************************************************
* Function Name  : Sleep_Mode
* Description    : Sleep mode. 
* Input          : None
* Output         : None
* Return         : None
* Attention		   : 1. There are 3 ways to wake up from sleep mode:  
											Touch Panel wake up, Key Scan wake up ,Software wake up. 
									 2. When using IIC interface, this function is not supported. 
*******************************************************************************/
void Sleep_Mode(void)
{
    LCD_CmdWrite(0x01);//PWRR
    LCD_DataWrite(0x02);
}

