Vadim139/ARM/STM32F429/LCD_7in/src/RA8875_Driver.c
/*******************************************************************************
* Function Name  : Software_Reset
* Description    : Software Reset. 
* Input          : None
* Output         : None
* Return         : None
* Attention		   : None
*******************************************************************************/
void Software_Reset(void)
{	
    LCD_CmdWrite(0x01);//PWRR
    LCD_DataWrite(0x01);
    LCD_DataWrite(0x00);
    delay_ms(1);// 
}					

/*******************************************************************************
* Function Name  : PCLK_inversion
* Description    : PDAT is fetched at PCLK falling edge.  
* Input          : None
* Output         : None
* Return         : None
* Attention		   : None
*******************************************************************************/
void PCLK_inversion(void)
{ 	
    uint8_t temp;
    LCD_CmdWrite(0x04);//PWRR
    temp = LCD_DataRead();
    temp |= cSetD7;
    LCD_DataWrite(temp);
}

/*******************************************************************************
* Function Name  : PCLK_inversion
* Description    : PDAT is fetched at PCLK rising edge.  
* Input          : None
* Output         : None
* Return         : None
* Attention		   : None
*******************************************************************************/
void PCLK_non_inversion(void)
{ 	
    uint8_t temp;
    LCD_CmdWrite(0x04);//PWRR
    temp = LCD_DataRead();
    temp &= cClrD7;
    LCD_DataWrite(temp);
}

/*******************************************************************************
* Function Name  : PCLK_width
* Description    : PCLK Period Setting  (Pixel clock (PCLK) period setting. )
* Input          : setx:
												00b: PCLK period = System Clock period. 
												01b: PCLK period = 2 times of System Clock period. 
												10b: PCLK period = 4 times of System Clock period. 
												11b: PCLK period = 8 times of System Clock period. 
* Output         : None
* Return         : None
* Attention		   : None
*******************************************************************************/
void PCLK_width(uint8_t setx) //uint8_t[1:0]
{ 	
    uint8_t temp;
    LCD_CmdWrite(0x04);//PWRR
    temp = LCD_DataRead();
    temp &=0x80;
    temp |= setx;
    LCD_DataWrite(temp);
}

/*******************************************************************************
* Function Name  : Serial_ROM_select0
* Description    : Serial Flash/ROM 0 I/F is selected. 
* Input          : None 
* Output         : None
* Return         : None
* Attention		   : None
*******************************************************************************/
void Serial_ROM_select0(void)
{       
    uint8_t temp;
    LCD_CmdWrite(0x05);//PWRR
    temp = LCD_DataRead();
    temp &=cClrD7;
    LCD_DataWrite(temp);
}
/*******************************************************************************
* Function Name  : Serial_ROM_select1
* Description    : Serial Flash/ROM 1 I/F is selected.  
* Input          : None 
* Output         : None
* Return         : None
* Attention		   : None
*******************************************************************************/
void Serial_ROM_select1(void)
{       
    uint8_t temp;
    LCD_CmdWrite(0x05);//PWRR
    temp = LCD_DataRead();
    temp |=cSetD7;
    LCD_DataWrite(temp);
}
/*******************************************************************************
* Function Name  : Serial_ROM_Address_set_24bit
* Description    : 24 bits address mode    
* Input          : None 
* Output         : None
* Return         : None
* Attention		   : None
*******************************************************************************/
void Serial_ROM_Address_set_24bit(void)
{       
    uint8_t temp;
    LCD_CmdWrite(0x05);//PWRR
    temp = LCD_DataRead();
    temp &=cClrD6;
    LCD_DataWrite(temp);
}
/*******************************************************************************
* Function Name  : Serial_ROM_Address_set_32bit
* Description    : 32 bits address mode    
* Input          : None 
* Output         : None
* Return         : None
* Attention		   : None
*******************************************************************************/
void Serial_ROM_Address_set_32bit(void)
{   
    uint8_t temp;
    LCD_CmdWrite(0x05);//PWRR
    temp = LCD_DataRead();
    temp |=cSetD6;
    LCD_DataWrite(temp);
}
/*******************************************************************************
* Function Name  : Select_Serial_Waveform_mode0
* Description    : Mode 0.   
* Input          : None 
* Output         : None
* Return         : None
* Attention		   : None
*******************************************************************************/
void Select_Serial_Waveform_mode0(void)
{	
    uint8_t temp;
    LCD_CmdWrite(0x05);//PWRR
    temp = LCD_DataRead();
    temp &=cClrD5;
    LCD_DataWrite(temp);
}
/*******************************************************************************
* Function Name  : Select_Serial_Waveform_mode3
* Description    : Mode 3.   
* Input          : None 
* Output         : None
* Return         : None
* Attention		   : None
*******************************************************************************/
void Select_Serial_Waveform_mode3(void)
{
    uint8_t temp;
    LCD_CmdWrite(0x05);//PWRR
    temp = LCD_DataRead();
    temp |=cSetD5;
    LCD_DataWrite(temp);
}
/*******************************************************************************
* Function Name  : SERIAL_ROM_Read_Cycle_4bus
* Description    : 4 bus -> no dummy cycle   
* Input          : None 
* Output         : None
* Return         : None
* Attention		   : None
*******************************************************************************/
void SERIAL_ROM_Read_Cycle_4bus(void)
{   
    uint8_t temp;
    LCD_CmdWrite(0x05);//PWRR
    temp = LCD_DataRead();
    temp &=0xE7;
    LCD_DataWrite(temp);
}
/*******************************************************************************
* Function Name  : SERIAL_ROM_Read_Cycle_5bus
* Description    : 5 bus -> no dummy cycle   
* Input          : None 
* Output         : None
* Return         : None
* Attention		   : None
*******************************************************************************/
void SERIAL_ROM_Read_Cycle_5bus(void)
{   
    uint8_t temp;
    LCD_CmdWrite(0x05);//PWRR
    temp = LCD_DataRead();
    temp &=0xE7;
    temp |=cSetD3;
    LCD_DataWrite(temp);
}
/*******************************************************************************
* Function Name  : SERIAL_ROM_Read_Cycle_6bus
* Description    : 6 bus -> no dummy cycle   
* Input          : None 
* Output         : None
* Return         : None
* Attention		   : None
*******************************************************************************/
void SERIAL_ROM_Read_Cycle_6bus(void)
{   uint8_t temp;
    LCD_CmdWrite(0x05);//PWRR
    temp = LCD_DataRead();
    temp &=0xE7;
    temp |=cSetD4;
    LCD_DataWrite(temp);
}
/*******************************************************************************
* Function Name  : SERIAL_ROM_Font_mode
* Description    : Font mode     
* Input          : None 
* Output         : None
* Return         : None
* Attention		   : None
*******************************************************************************/
void SERIAL_ROM_Font_mode(void)
{   uint8_t temp;
    LCD_CmdWrite(0x05);//PWRR
    temp = LCD_DataRead();
    temp &=cClrD2;
    LCD_DataWrite(temp);
}


