Vadim139/ARM/STM32F429/LCD_7in/src/RA8875_Driver.c
/*******************************************************************************
* Function Name  : SERIAL_ROM_DMA_mode
* Description    : DMA mode     
* Input          : None 
* Output         : None
* Return         : None
* Attention		   : None
*******************************************************************************/
void SERIAL_ROM_DMA_mode(void)
{   uint8_t temp;
    LCD_CmdWrite(0x05);//PWRR
    temp = LCD_DataRead();
    temp |=cSetD2;
    LCD_DataWrite(temp);
}

/*******************************************************************************
* Function Name  : SERIAL_ROM_Signal_mode
* Description    : Single Mode     
* Input          : None 
* Output         : None
* Return         : None
* Attention		   : None
*******************************************************************************/
void SERIAL_ROM_Signal_mode(void)
{   uint8_t temp;
    LCD_CmdWrite(0x05);//PWRR
    temp = LCD_DataRead();
    temp &=0xFC;
    LCD_DataWrite(temp);
}
/*******************************************************************************
* Function Name  : SERIAL_ROM_Dual_mode0
* Description    : Dual Mode 0     
* Input          : None 
* Output         : None
* Return         : None
* Attention		   : None
*******************************************************************************/

void SERIAL_ROM_Dual_mode0(void)
{   uint8_t temp;
    LCD_CmdWrite(0x05);//PWRR
    temp = LCD_DataRead();
    temp &=0xFC;
    temp |=cSetD1;
    LCD_DataWrite(temp);
}
/*******************************************************************************
* Function Name  : SERIAL_ROM_Dual_mode1
* Description    : Dual Mode 1     
* Input          : None 
* Output         : None
* Return         : None
* Attention		   : None
*******************************************************************************/
void SERIAL_ROM_Dual_mode1(void)
{   uint8_t temp;
    LCD_CmdWrite(0x05);//PWRR
    temp = LCD_DataRead();
    temp &=0xFC;
    temp |=cSetD1;
    temp |=cSetD0;
    LCD_DataWrite(temp);
}
/*******************************************************************************
* Function Name  : SROM_CLK_DIV
* Description    : Serial Flash/ROM Clock Frequency Setting   
* Input          : CLK_DIV ：Serial Flash/ROM Clock Frequency Setting 
*									0xb: SFCL frequency = System clock frequency 
*											 (When DMA enable and Color depth = 256 color 
*											  SFCL frequency = System clock frequency /2) 
*									10b: SFCL frequency = System clock frequency / 2 
*									11b: SFCL frequency = System clock frequency / 4 	
* Output         : None
* Return         : None
* Attention		   : None
*******************************************************************************/
void SROM_CLK_DIV(uint8_t CLK_DIV)
{
    LCD_CmdWrite(0x06);
    LCD_DataWrite(CLK_DIV);
}


/*******************************************************************************
* Function Name  : Color_256
* Description    : Color Depth Setting ，8-bpp generic TFT, i.e. 256 colors  
* Input          : None 
* Output         : None
* Return         : None
* Attention		   : None
*******************************************************************************/
void Color_256(void)
{
	uint8_t temp;
	LCD_CmdWrite(0x10);//SYSR
	temp = LCD_DataRead();
	temp &= cClrD3D2 ;
	LCD_DataWrite(temp);
} 
/*******************************************************************************
* Function Name  : Color_65K
* Description    : Color Depth Setting ，16-bpp generic TFT, i.e. 65K colors.  
* Input          : None 
* Output         : None
* Return         : None
* Attention		   : None
*******************************************************************************/
void Color_65K(void)
{
     uint8_t temp;
     LCD_CmdWrite(0x10);//SYSR
     temp = LCD_DataRead();
     temp &= cClrD3D2 ;
     temp |= cSetD3ClrD2 ;
     LCD_CmdWrite(0x10);//SYSR
     LCD_DataWrite(temp);
}

/*******************************************************************************
* Function Name  : MPU_8bit_Interface
* Description    : MCUIF Selection ， 8-bit MCU Interface. 
* Input          : None 
* Output         : None
* Return         : None
* Attention		   : None
*******************************************************************************/
void MPU_8bit_Interface(void)
{
	uint8_t temp;
	LCD_CmdWrite(0x10);//SYSR
	temp = LCD_DataRead();
	temp &= cClrD1D0 ;
	LCD_DataWrite(temp);
}
/*******************************************************************************
* Function Name  : MPU_16bit_Interface
* Description    : MCUIF Selection ， 16-bit MCU Interface. 
* Input          : None 
* Output         : None
* Return         : None
* Attention		   : None
*******************************************************************************/
void MPU_16bit_Interface(void)
{
	uint8_t temp;
	LCD_CmdWrite(0x10);//SYSR
	temp = LCD_DataRead();
	temp |= cSetD1ClrD0 ;
	LCD_DataWrite(temp);
} 								 
/*******************************************************************************
* Function Name  : GPI_data
* Description    : General Purpose Input. 
* Input          : None 
* Output         : None
* Return         : None
* Attention		   : KEY_EN : REG[C0h] bit 7 
*******************************************************************************/
uint8_t GPI_data(void)
{   
  uint8_t temp;
  LCD_CmdWrite(0x12);//SYSR
  temp = LCD_DataRead();
  return temp;
}
/*******************************************************************************
* Function Name  : GPO_data
* Description    : General Purpose Output  
* Input          : setx ：GPO[3:0] : General Purpose Output 
* Output         : None
* Return         : None
* Attention		   : KEY_EN : REG[C0h] bit 7 
*******************************************************************************/
void GPO_data(uint8_t setx)
{
  LCD_CmdWrite(0x13); 
  LCD_DataWrite(setx);
}

/*******************************************************************************
* Function Name  : One_Layer
* Description    : Layer Setting Control ，One layer configuration is selected.  
* Input          : None 
* Output         : None
* Return         : None
* Attention		   : None
*******************************************************************************/
void One_Layer(void)
{
	uint8_t temp;
	LCD_CmdWrite(0x20);//DPCR
	temp = LCD_DataRead();
	temp &= cClrD7 ;
	LCD_DataWrite(temp);
}	
/*******************************************************************************
* Function Name  : Two_Layers
* Description    : Layer Setting Control ，Two layers configuration is selected.. 
* Input          : None 
* Output         : None
* Return         : None
* Attention		   : None
*******************************************************************************/			 
void Two_Layers(void)
{	uint8_t temp;
	LCD_CmdWrite(0x20);//DPCR
	temp = LCD_DataRead();
	temp |= cSetD7 ;
	LCD_DataWrite(temp);
}
/*******************************************************************************
* Function Name  : HDIR_SEG0_SEGn
* Description    : Horizontal Scan Direction, for n = SEG number. SEG0 to SEG(n-1). 
* Input          : None 
* Output         : None
* Return         : None
* Attention		   : None
*******************************************************************************/		
void HDIR_SEG0_SEGn(void)
{	uint8_t temp;
	LCD_CmdWrite(0x20);//DPCR
	temp = LCD_DataRead();
	temp &= cClrD3 ;
	LCD_DataWrite(temp);
}
/*******************************************************************************
* Function Name  : HDIR_SEGn_SEG0
* Description    : Horizontal Scan Direction, for n = SEG number. SEG(n-1) to SEG0. 
* Input          : None 
* Output         : None
* Return         : None
* Attention		   : None
*******************************************************************************/		
void HDIR_SEGn_SEG0(void)
{
	uint8_t temp;

	LCD_CmdWrite(0x20);//DPCR
	temp = LCD_DataRead();
	temp |= cSetD3 ;
	LCD_DataWrite(temp);
}
/*******************************************************************************
* Function Name  : VDIR_COM0_COMn
* Description    : Vertical Scan direction, for n = COM numbe ：COM0 to COM(n-1) 
* Input          : None 
* Output         : None
* Return         : None
* Attention		   : None
*******************************************************************************/
void VDIR_COM0_COMn(void)
{
	uint8_t temp;

	LCD_CmdWrite(0x20);//DPCR
	temp = LCD_DataRead();
	temp &= cClrD2 ;
	LCD_DataWrite(temp);
}
/*******************************************************************************
* Function Name  : VDIR_COMn_COM0
* Description    : Vertical Scan direction, for n = COM numbe ：COM(n-1) to COM0 
* Input          : None 
* Output         : None
* Return         : None
* Attention		   : None
*******************************************************************************/
void VDIR_COMn_COM0(void)
{
	uint8_t temp;

	LCD_CmdWrite(0x20);//DPCR
	temp = LCD_DataRead();
	temp |= cSetD2 ;
	LCD_DataWrite(temp);
}
/*******************************************************************************
* Function Name  : CGROM_Font
* Description    : CGRAM/CGROM Font Selection Bit in Text Mode ，CGROM font is selected. 
* Input          : None 
* Output         : None
* Return         : None
* Attention		   :  The bit is used to select the bit-map source when text-
										mode is active(REG[40h] bit 7 is 1), when CGRAM is 
										writing(REG[41h] bit 3-2 =01b), the bit  must be set as “0”.
*******************************************************************************/
void CGROM_Font(void)
{
	uint8_t temp;
	LCD_CmdWrite(0x21);//FNCR0
	temp = LCD_DataRead();
	temp &= cClrD7 ;
	LCD_DataWrite(temp);
}
/*******************************************************************************
* Function Name  : CGROM_Font
* Description    : CGRAM/CGROM Font Selection Bit in Text Mode ，CGRAM font is selected. 
* Input          : None 
* Output         : None
* Return         : None
* Attention		   :  The bit is used to select the bit-map source when text-
										mode is active(REG[40h] bit 7 is 1), when CGRAM is 
										writing(REG[41h] bit 3-2 =01b), the bit  must be set as “0”.
*******************************************************************************/
void CGRAM_Font(void)
{
	uint8_t temp;
	LCD_CmdWrite(0x21);//FNCR0
	temp = LCD_DataRead();
	temp |= cSetD7 ;
	LCD_DataWrite(temp);
}
/*******************************************************************************
* Function Name  : Internal_CGROM
* Description    : External/Internal CGROM Selection Bit ，
									 Internal CGROM is selected.(REG[2Fh] must be set 00h ) 
* Input          : None 
* Output         : None
* Return         : None
* Attention		   : None
*******************************************************************************/

void Internal_CGROM(void)
{
	uint8_t temp;
	LCD_CmdWrite(0x21);//FNCR0
	temp = LCD_DataRead();
	temp &= cClrD5 ;
	LCD_DataWrite(temp);
}
/*******************************************************************************
* Function Name  : External_CGROM
* Description    : External/Internal CGROM Selection Bit ，
									  External CGROM is selected. 
* Input          : None 
* Output         : None
* Return         : None
* Attention		   : None
*******************************************************************************/
void External_CGROM(void)
{
	uint8_t temp;
	LCD_CmdWrite(0x21);//FNCR0
	temp = LCD_DataRead();
	temp |= cSetD5 ;
	LCD_DataWrite(temp);
}
/*******************************************************************************
* Function Name  : ISO8859_1
* Description    :  When FNCR0 B7 = 0 and B5 = 0, Internal CGROM supports the
										8x16 character sets with the standard coding of ISO/IEC 8859-
										1~4, which supports English and most of European country
										languages.  

										Selection ISO/IEC 8859-1. 
* Input          : None 
* Output         : None
* Return         : None
* Attention		   : None
*******************************************************************************/
void ISO8859_1(void)
{
	uint8_t temp;
	LCD_CmdWrite(0x21);//FNCR0
	temp = LCD_DataRead();
	temp &= cClrD1D0 ;
	LCD_DataWrite(temp);
}
/*******************************************************************************
* Function Name  : ISO8859_2
* Description    :  When FNCR0 B7 = 0 and B5 = 0, Internal CGROM supports the
										8x16 character sets with the standard coding of ISO/IEC 8859-
										1~4, which supports English and most of European country
										languages.  

										Selection ISO/IEC 8859-2.
* Input          : None 
* Output         : None
* Return         : None
* Attention		   : None
*******************************************************************************/
void ISO8859_2(void)
{
	uint8_t temp;
	LCD_CmdWrite(0x21);//FNCR0
	temp = LCD_DataRead();
	temp &= cClrD1D0 ;
	temp |= cClrD1SetD0 ;
	LCD_DataWrite(temp);
}
/*******************************************************************************
* Function Name  : ISO8859_3
* Description    :  When FNCR0 B7 = 0 and B5 = 0, Internal CGROM supports the
										8x16 character sets with the standard coding of ISO/IEC 8859-
										1~4, which supports English and most of European country
										languages.  

										Selection ISO/IEC 8859-3. 
* Input          : None 
* Output         : None
* Return         : None
* Attention		   : None
*******************************************************************************/
void ISO8859_3(void)
{
	uint8_t temp;
	LCD_CmdWrite(0x21);//FNCR0
	temp = LCD_DataRead();
	temp &= cClrD1D0 ;
	temp |= cSetD1ClrD0 ;
	LCD_DataWrite(temp);
}
/*******************************************************************************
* Function Name  : ISO8859_4
* Description    :  When FNCR0 B7 = 0 and B5 = 0, Internal CGROM supports the
										8x16 character sets with the standard coding of ISO/IEC 8859-
										1~4, which supports English and most of European country
										languages.  

