Vadim139/ARM/STM32F429/LCD_7in/src/RA8875_Driver.c
										Selection ISO/IEC 8859-4. 
* Input          : None 
* Output         : None
* Return         : None
* Attention		   : None
*******************************************************************************/
void ISO8859_4(void)
{
	uint8_t temp;
	LCD_CmdWrite(0x21);//FNCR0
	temp = LCD_DataRead();
	temp &= cClrD1D0 ;
	temp |= cSetD1D0 ;
	LCD_DataWrite(temp);
}								 
//--------------------------------//
//REG[22h]

void No_FullAlignment(void)
{
	uint8_t temp;
	LCD_CmdWrite(0x22);//FNCR1
	temp = LCD_DataRead();
	temp &= cClrD7 ;
	LCD_DataWrite(temp);
}
void FullAlignment(void)
{
	uint8_t temp;
	LCD_CmdWrite(0x22);//FNCR1
	temp = LCD_DataRead();
	temp |= cSetD7 ;
	LCD_DataWrite(temp);
}
void Font_with_BackgroundColor(void)
{
	uint8_t temp;
	LCD_CmdWrite(0x22);//FNCR1
	temp = LCD_DataRead();
	temp &= cClrD6 ;
	LCD_DataWrite(temp);
}
void Font_with_BackgroundTransparency(void)
{
	uint8_t temp;
	LCD_CmdWrite(0x22);//FNCR1
	temp = LCD_DataRead();
	temp |= cSetD6 ;
	LCD_DataWrite(temp);
}


void NoRotate_Font(void)
{
	uint8_t temp;
	LCD_CmdWrite(0x22);//FNCR1
	temp = LCD_DataRead();
	temp &= cClrD4 ;
	LCD_DataWrite(temp);
}
void Rotate90_Font(void)
{
	uint8_t temp;
	LCD_CmdWrite(0x22);//FNCR1
	temp = LCD_DataRead();
	temp |= cSetD4 ;
	LCD_DataWrite(temp);
}


void Horizontal_FontEnlarge_x1(void)
{
	uint8_t temp;
	LCD_CmdWrite(0x22);//FNCR1
	temp = LCD_DataRead();
	temp &= cClrD3D2 ;
	LCD_DataWrite(temp);
}
void Horizontal_FontEnlarge_x2(void)
{
	uint8_t temp;
	LCD_CmdWrite(0x22);//FNCR1
	temp = LCD_DataRead();
	temp &= cClrD3D2 ;
	temp |= cClrD3SetD2 ;
	LCD_DataWrite(temp);
}
void Horizontal_FontEnlarge_x3(void)
{
	uint8_t temp;
	LCD_CmdWrite(0x22);//FNCR1
	temp = LCD_DataRead();
	temp &= cClrD3D2 ;
	temp |= cSetD3ClrD2 ;
	LCD_DataWrite(temp);
}
void Horizontal_FontEnlarge_x4(void)
{
	uint8_t temp;
	LCD_CmdWrite(0x22);//FNCR1
	temp = LCD_DataRead();
	temp &= cClrD3D2 ;
	temp |= cSetD3D2 ;
	LCD_DataWrite(temp);
}
void Vertical_FontEnlarge_x1(void)
{
	uint8_t temp;
	LCD_CmdWrite(0x22);//FNCR1
	temp = LCD_DataRead();
	temp &= cClrD1D0 ;
	LCD_DataWrite(temp);
}
void Vertical_FontEnlarge_x2(void)
{
	uint8_t temp;
	LCD_CmdWrite(0x22);//FNCR1
	temp = LCD_DataRead();
	temp &= cClrD1D0 ;
	temp |= cClrD1SetD0 ;
	LCD_DataWrite(temp);
}
void Vertical_FontEnlarge_x3(void)
{
	uint8_t temp;
	LCD_CmdWrite(0x22);//FNCR1
	temp = LCD_DataRead();
	temp &= cClrD1D0 ;
	temp |= cSetD1ClrD0 ;
	LCD_DataWrite(temp);
}
void Vertical_FontEnlarge_x4(void)
{
	uint8_t temp;
	LCD_CmdWrite(0x22);//FNCR1
	temp = LCD_DataRead();
	temp &= cClrD1D0 ;
	temp |= cSetD1D0 ;
	LCD_DataWrite(temp);
}

//-------------------------------------------//
//REG[23h]									 
void CGRAM_Select_Number(uint8_t setx)
{ 
    LCD_CmdWrite(0x23);//CGSR
    LCD_DataWrite(setx);
}	
								
//-------------------------------------------//
//REG[24h]REG[25h]REG[26h]REG[27h]
void Scroll_Offset(uint16_t X,uint16_t Y)
{

    LCD_CmdWrite(0x24);//HOFS0
    LCD_DataWrite(X);
  
    LCD_CmdWrite(0x25);//HOFS1	   
    LCD_DataWrite(X>>8);
	  
    LCD_CmdWrite(0x26);//VOFS0
    LCD_DataWrite(Y);  

    LCD_CmdWrite(0x27);//VOFS1	   
    LCD_DataWrite(Y>>8); 
}	 
//-------------------------------------------//
//REG[29h]
void Line_distance(uint8_t setx)
{ 
    LCD_CmdWrite(0x29);//LDS
    LCD_DataWrite(setx);
}	  
//-------------------------------------------//
//REG[2Ah]REG[2Bh]REG[2Ch]REG[2Dh]
void Font_Coordinate(uint16_t X,uint16_t Y)
{
 
    LCD_CmdWrite(0x2A);//HOFS0
    LCD_DataWrite(X);

    LCD_CmdWrite(0x2B);//HOFS1	   
    LCD_DataWrite(X>>8);
 
    LCD_CmdWrite(0x2C);//VOFS0
    LCD_DataWrite(Y);

    LCD_CmdWrite(0x2D);//VOFS1	   
    LCD_DataWrite(Y>>8); 
}


//-------------------------------------------//
//REG[2Eh]
void Font_size_16x16_8x16(void) 
{
 	uint8_t temp;
	LCD_CmdWrite(0x2E);//FNCR1
	temp = LCD_DataRead();
	temp &= 0x3f;
	LCD_DataWrite(temp);
}

void Font_size_24x24_12x24(void) 
{
 	uint8_t temp;
	LCD_CmdWrite(0x2E);//FNCR1
	temp = LCD_DataRead();
	temp &= 0x3f;
	temp |= 0x40; 
	LCD_DataWrite(temp);
}

void Font_size_32x32_16x32(void) 
{
 	uint8_t temp;
	LCD_CmdWrite(0x2E);//FNCR1
	temp = LCD_DataRead();
	temp &= 0x3f;
	temp |= 0x80; 
	LCD_DataWrite(temp);
}


void Font_spacing_set(uint8_t setx) //uint8_t[5:0]
{   uint8_t temp,temp1;
    temp1=setx&0x3F;
   	LCD_CmdWrite(0x2E);//FNCR1
	temp = LCD_DataRead();
	temp &= 0xc0;
	temp |= temp1; 
	LCD_DataWrite(temp);

}

//-------------------------------------------//
//REG[2Fh]
void GT_serial_ROM_select_GT21L16T1W(void)
{ uint8_t temp;
  LCD_CmdWrite(0x2F);//FNCR1
  temp = LCD_DataRead();
  temp &= 0x1f;
  LCD_DataWrite(temp);
}

void GT_serial_ROM_select_GT23L16U2W(void)
{ uint8_t temp;
  LCD_CmdWrite(0x2F);//FNCR1
  temp = LCD_DataRead();
  temp &= 0x1f;
  temp |= 0x20;
  LCD_DataWrite(temp);
}

void GT_serial_ROM_select_GT23L24T3Y(void)
{ uint8_t temp;
  LCD_CmdWrite(0x2F);//FNCR1
  temp = LCD_DataRead();
  temp &= 0x1f;
  temp |= 0x40;
  LCD_DataWrite(temp);
}

void GT_serial_ROM_select_GT23L24M1Z(void)
{ uint8_t temp;
  LCD_CmdWrite(0x2F);//FNCR1
  temp = LCD_DataRead();
  temp &= 0x1f;
  temp |= 0x60;
  LCD_DataWrite(temp);
}

void GT_serial_ROM_select_GT23L32S4W(void)
{ uint8_t temp;
  LCD_CmdWrite(0x2F);//FNCR1
  temp = LCD_DataRead();
  temp &= 0x1f;
  temp |= 0x80;
  LCD_DataWrite(temp);
}

void Font_code_GB2312(void)
{ uint8_t temp;
  LCD_CmdWrite(0x2F);//FNCR1
  temp = LCD_DataRead();
  temp &= 0xE3;
  LCD_DataWrite(temp);
}

void Font_code_GB12345(void)
{ uint8_t temp;
  LCD_CmdWrite(0x2F);//FNCR1
  temp = LCD_DataRead();
  temp &= 0xE3;
   temp |= 0x04;
  LCD_DataWrite(temp);
}

void Font_code_BIG5(void)
{ uint8_t temp;
  LCD_CmdWrite(0x2F);//FNCR1
  temp = LCD_DataRead();
  temp &= 0xE3;
  temp |= 0x08;
  LCD_DataWrite(temp);
}

void Font_code_UNICODE(void)
{ uint8_t temp;
  LCD_CmdWrite(0x2F);//FNCR1
  temp = LCD_DataRead();
  temp &= 0xE3;
  temp |= 0x0C;
  LCD_DataWrite(temp);
}

void Font_code_ASCII(void)
{ uint8_t temp;
  LCD_CmdWrite(0x2F);//FNCR1
  temp = LCD_DataRead();
  temp &= 0xE3;
  temp |= 0x10;
  LCD_DataWrite(temp);
}

