Vadim139/ARM/STM32F429/LCD_7in/src/RA8875_Driver.c
void Font_code_UNIJIS(void)
{ uint8_t temp;
  LCD_CmdWrite(0x2F);//FNCR1
  temp = LCD_DataRead();
  temp &= 0xE3;
  temp |= 0x14;
  LCD_DataWrite(temp);
}

void Font_code_JIS0208(void)
{ uint8_t temp;
  LCD_CmdWrite(0x2F);//FNCR1
  temp = LCD_DataRead();
  temp &= 0xE3;
  temp |= 0x18;
  LCD_DataWrite(temp);
}

void Font_code_LATIN(void)
{ uint8_t temp;
  LCD_CmdWrite(0x2F);//FNCR1
  temp = LCD_DataRead();
  temp &= 0xE3;
  temp |= 0x1C;
  LCD_DataWrite(temp);
}

void Font_Standard(void)
{ uint8_t temp;
  LCD_CmdWrite(0x2F);//FNCR1
  temp = LCD_DataRead();
  temp &= 0xFC;
  LCD_DataWrite(temp);
}

void Font_Arial(void)
{ uint8_t temp;
  LCD_CmdWrite(0x2F);//FNCR1
  temp = LCD_DataRead();
  temp &= 0xFC;
  temp |= 0x01;
  LCD_DataWrite(temp);
}

void Font_Roman(void)
{ uint8_t temp;
  LCD_CmdWrite(0x2F);//FNCR1
  temp = LCD_DataRead();
  temp &= 0xFC;
  temp |= 0x02;
  LCD_DataWrite(temp);
}

void Font_Bold(void) //for ASCII
{ uint8_t temp;
  LCD_CmdWrite(0x2F);//FNCR1
  temp = LCD_DataRead();
  temp &= cClrD1D0;
  temp |= cSetD1D0;
  LCD_DataWrite(temp);
}

//-------------------------------------------//
//REG[30h]~REG[37h]
void Active_Window(uint16_t XL,uint16_t XR ,uint16_t YT ,uint16_t YB)
{
    //setting active window X
  
    LCD_CmdWrite(0x30);//HSAW0
    LCD_DataWrite(XL); 
    LCD_CmdWrite(0x31);//HSAW1	   
    LCD_DataWrite(XL>>8);

    LCD_CmdWrite(0x34);//HEAW0
    LCD_DataWrite(XR);
    LCD_CmdWrite(0x35);//HEAW1	   
    LCD_DataWrite(XR>>8);

    //setting active window Y
  
    LCD_CmdWrite(0x32);//VSAW0
    LCD_DataWrite(YT);  
    LCD_CmdWrite(0x33);//VSAW1	   
    LCD_DataWrite(YT>>8);
  
    LCD_CmdWrite(0x36);//VEAW0
    LCD_DataWrite(YB); 
    LCD_CmdWrite(0x37);//VEAW1	   
    LCD_DataWrite(YB>>8);
}
//--------------------------------------------//
//REG[38h]~REG[3Fh]

void Scroll_Window(uint16_t XL,uint16_t XR ,uint16_t YT ,uint16_t YB)
{
 
    LCD_CmdWrite(0x38);//HSSW0
    LCD_DataWrite(XL);
    LCD_CmdWrite(0x39);//HSSW1	   
    LCD_DataWrite(XL>>8);
  
    LCD_CmdWrite(0x3c);//HESW0
    LCD_DataWrite(XR);  
    LCD_CmdWrite(0x3d);//HESW1	   
    LCD_DataWrite(XR>>8);   
    
    LCD_CmdWrite(0x3a);//VSSW0
    LCD_DataWrite(YT);
    LCD_CmdWrite(0x3b);//VSSW1	   
    LCD_DataWrite(YT>>8);
  
    LCD_CmdWrite(0x3e);//VESW0
    LCD_DataWrite(YB);  
    LCD_CmdWrite(0x3f);//VESW1	   
    LCD_DataWrite(YB>>8);
}  


//--------------------------------------------//
//REG[40h]
void Graphic_Mode(void)
{	
  uint8_t temp;
  LCD_CmdWrite(0x40);//MWCR0
  temp = LCD_DataRead();
  temp &= cClrD7 ;
  LCD_DataWrite(temp);
}

void Text_Mode(void)
{	
  uint8_t temp;
  LCD_CmdWrite(0x40);//MWCR0
  temp = LCD_DataRead();
  temp |= cSetD7 ;
  LCD_DataWrite(temp);	 
} 

void Text_Cursor_Disable(void)
{	
  uint8_t temp;
  LCD_CmdWrite(0x40);//MWCR0
  temp = LCD_DataRead();
  temp &= cClrD6 ;
  LCD_DataWrite(temp);
}

void Text_Cursor_Enable(void)
{	
  uint8_t temp;
  LCD_CmdWrite(0x40);//MWCR0
  temp = LCD_DataRead();
  temp |= cSetD6 ;
  LCD_DataWrite(temp);	 	
} 

void Text_Cursor_Blink_Disable(void)
{	uint8_t temp;
	LCD_CmdWrite(0x40);//MWCR0
	temp = LCD_DataRead();
	temp &= cClrD5 ;
	LCD_DataWrite(temp);
}

void Text_Cursor_Blink_Enable(void)
{	uint8_t temp;
	LCD_CmdWrite(0x40);//MWCR0
	temp = LCD_DataRead();
	temp |= cSetD5 ;
	LCD_DataWrite(temp);
}

void Memory_Write_LeftRight_TopDown(void)
{	uint8_t temp;
	LCD_CmdWrite(0x40);//MWCR0
	temp = LCD_DataRead();
	temp &= cClrD3D2 ;
	LCD_DataWrite(temp);
}

void Memory_Write_RightLeft_TopDown(void)
{	uint8_t temp;
	LCD_CmdWrite(0x40);//MWCR0
	temp = LCD_DataRead();
	temp &= cClrD3D2 ;
	temp |= cClrD3SetD2 ;
	LCD_DataWrite(temp);
}

void Memory_Write_DownTop_LeftRight(void)
{	uint8_t temp;	
	LCD_CmdWrite(0x40);//MWCR0
	temp = LCD_DataRead();
	temp &= cClrD3D2 ;
	temp |= cSetD3D2 ;
	LCD_DataWrite(temp);
}

void Memory_Write_TopDown_LeftRight(void)
{	uint8_t temp;
	LCD_CmdWrite(0x40);//MWCR0
	temp = LCD_DataRead();
	temp &= cClrD3D2 ;
	temp |= cSetD3ClrD2 ;
	LCD_DataWrite(temp);
} 

void MemoryWrite_Cursor_autoIncrease(void)
{	uint8_t temp;
	LCD_CmdWrite(0x40);//MWCR0
	temp = LCD_DataRead();
	temp &= cClrD1 ;
	LCD_DataWrite(temp);
}

void MemoryWrite_Cursor_NoautoIncrease(void)
{	uint8_t temp;
	LCD_CmdWrite(0x40);//MWCR0
	temp = LCD_DataRead();
	temp |= cSetD1 ;
	LCD_DataWrite(temp);
}

void MemoryRead_Cursor_autoIncrease(void)
{	uint8_t temp;
	LCD_CmdWrite(0x40);//MWCR0
	temp = LCD_DataRead();
	temp &= cClrD0 ;
	LCD_DataWrite(temp);
}

void MemoryRead_Cursor_NoautoIncrease(void)
{
	uint8_t temp;

	LCD_CmdWrite(0x40);//MWCR0
	temp = LCD_DataRead();
	temp |= cSetD0 ;
	LCD_DataWrite(temp);
}  										 

//--------------------------------------------//
//REG[41h]
void No_Graphic_Cursor(void)
{	uint8_t temp;
	LCD_CmdWrite(0x41);//MWCR1
	temp = LCD_DataRead();
	temp &= cClrD7 ;
	LCD_DataWrite(temp);
}

void Graphic_Cursor(void)
{	uint8_t temp;
	LCD_CmdWrite(0x41);//MWCR1
	temp = LCD_DataRead();
	temp |= cSetD7 ;
	LCD_DataWrite(temp);
}

void Graphic_Cursor_Set1(void)
{	uint8_t temp;
	LCD_CmdWrite(0x41);//MWCR1
	temp = LCD_DataRead();
	temp &= cClrD6D5D4;
	LCD_DataWrite(temp);
}

void Graphic_Cursor_Set2(void)
{	uint8_t temp;
	LCD_CmdWrite(0x41);//MWCR1
	temp = LCD_DataRead();
	temp &= cClrD6D5D4 ;
	temp |= cClrD6D5SetD4 ;
	LCD_DataWrite(temp);
}

void Graphic_Cursor_Set3(void)
{	uint8_t temp;
	LCD_CmdWrite(0x41);//MWCR1
	temp = LCD_DataRead();
	temp &= cClrD6D5D4 ;
	temp |= cClrD6SetD5ClrD4 ;
	LCD_DataWrite(temp);
}

void Graphic_Cursor_Set4(void)
{	uint8_t temp;
	LCD_CmdWrite(0x41);//MWCR1
	temp = LCD_DataRead();
	temp &= cClrD6D5D4 ;
	temp |= cClrD6SetD5D4 ;
	LCD_DataWrite(temp);
}

void Graphic_Cursor_Set5(void)
{	uint8_t temp;
	LCD_CmdWrite(0x41);//MWCR1
	temp = LCD_DataRead();
	temp &= cClrD6D5D4 ;
	temp |= cSetD6ClrD5D4 ;
	LCD_DataWrite(temp);
}

void Graphic_Cursor_Set6(void)
{	uint8_t temp;
	LCD_CmdWrite(0x41);//MWCR1
	temp = LCD_DataRead();
	temp &= cClrD6D5D4 ;
	temp |= cSetD6ClrD5SetD4 ;
	LCD_DataWrite(temp);
}

void Graphic_Cursor_Set7(void)
{	uint8_t temp;
	LCD_CmdWrite(0x41);//MWCR1
	temp = LCD_DataRead();
	temp &= cClrD6D5D4 ;
	temp |= cSetD6D5ClrD4 ;
	LCD_DataWrite(temp);
}

void Graphic_Cursor_Set8(void)
{	uint8_t temp;
	LCD_CmdWrite(0x41);//MWCR1
	temp = LCD_DataRead();
	temp &= cClrD6D5D4 ;
	temp |= cSetD6D5D4 ;
	LCD_DataWrite(temp);
}

