Vadim139/ARM/STM32F429/LCD_7in/src/RA8875_Driver.c
void Write_To_Bank1and2(void)
{	uint8_t temp;
	LCD_CmdWrite(0x41);//MWCR1
	temp = LCD_DataRead();
	temp &= cClrD3D2 ;
	LCD_DataWrite(temp);
}

void Write_To_CGRAM(void)
{	uint8_t temp;
	LCD_CmdWrite(0x41);//MWCR1
	temp = LCD_DataRead();
	temp &= 0xf3;
	temp |= cClrD3SetD2 ;
	LCD_DataWrite(temp);
}

void Write_To_GraphicCursor(void)
{	uint8_t temp;
	LCD_CmdWrite(0x41);//MWCR1
	temp = LCD_DataRead();
	temp &= 0xf3;
	temp |= cSetD3ClrD2 ;
	LCD_DataWrite(temp);
}

void Write_To_Pattern(void)
{	uint8_t temp;
	LCD_CmdWrite(0x41);//MWCR1
	temp = LCD_DataRead();
	temp &= 0xf3;
	temp |= cSetD3D2 ;
	LCD_DataWrite(temp);
}
						   
void Write_To_Bank1(void)
{	uint8_t temp;
	LCD_CmdWrite(0x41);//MWCR1
	temp = LCD_DataRead();
	temp &= cClrD0 ;
	LCD_DataWrite(temp);
}

void Write_To_Bank2(void)
{	uint8_t temp;
	LCD_CmdWrite(0x41);//MWCR1
	temp = LCD_DataRead();
	temp |= cSetD0 ;
	LCD_DataWrite(temp);  
}	
							
//--------------------------------------------//
//--------------------------------------------//
//REG[44h]
void Text_Blink_Time(uint8_t setx)
{	
	LCD_CmdWrite(0x44);//CURS
	LCD_DataWrite(setx);
}

//--------------------------------------------//
//REG[45h]  
void Memory_read_LeftRight_TopDown(void)
{	uint8_t temp;
	LCD_CmdWrite(0x45);//MRCD
	temp = LCD_DataRead();
	temp &= cClrD1D0;
	LCD_DataWrite(temp);
}
void Memory_read_RightLeft_TopDown(void)
{	uint8_t temp;
	LCD_CmdWrite(0x45);//MRCD
	temp = LCD_DataRead();
	temp |= cClrD1SetD0;
	LCD_DataWrite(temp);
}
void Memory_read_TopDown_LeftRight(void)
{	uint8_t temp;
	LCD_CmdWrite(0x45);//MRCD
	temp = LCD_DataRead();
	temp |= cSetD1ClrD0;
	LCD_DataWrite(temp);
}
void Memory_read_DownTop_LeftRight(void)
{	uint8_t temp;
	LCD_CmdWrite(0x45);//MRCD
	temp = LCD_DataRead();
	temp |= cSetD1D0;
	LCD_DataWrite(temp);
}			

//--------------------------------------------//
//REG[46h]~REG[49h]
void XY_Coordinate(uint16_t X,uint16_t Y)
{
    LCD_CmdWrite(0x46);
    LCD_DataWrite(X);  
    LCD_CmdWrite(0x47);	   
    LCD_DataWrite(X>>8);
 
    LCD_CmdWrite(0x48);
    LCD_DataWrite(Y);  
    LCD_CmdWrite(0x49);	   
    LCD_DataWrite(Y>>8);
}



//--------------------------------------------//
//REG[4Ah]~REG[4Dh]
void Memory_read_Coordinate(uint16_t X,uint16_t Y)
{

    LCD_CmdWrite(0x4a);
    LCD_DataWrite(X);   
    LCD_CmdWrite(0x4b);	   
    LCD_DataWrite(X>>8);
   
    LCD_CmdWrite(0x4c);
    LCD_DataWrite(Y);
    LCD_CmdWrite(0x4d);	   
    LCD_DataWrite(Y>>8);
} 
						  
//--------------------------------------------//
//REG[4Eh]
void Text_Cursor_Horizontal_Size(uint8_t setx)//uint8_t[3:0]
{
    LCD_CmdWrite(0x4E);//CURS	   
    LCD_DataWrite(setx);
} 
								
//REG[4Fh] 
void Text_Cursor_Vertical_Size(uint8_t setx)//uint8_t[3:0]
{
    LCD_CmdWrite(0x4F);//CURS	   
    LCD_DataWrite(setx);
} 	
	
//--------------------------------------------//
//REG[50h] 
void no_BTE_write(void)
{	
        uint8_t temp;
	LCD_CmdWrite(0x50);//BECR0
	temp = LCD_DataRead();
	temp &= cClrD7 ;
	LCD_DataWrite(temp);  
}

void BTE_enable(void)
{	uint8_t temp;
	LCD_CmdWrite(0x50);//BECR0
	temp = LCD_DataRead();
	temp |= cSetD7 ;
	LCD_DataWrite(temp);  
}

void BTE_contiguous_Data(void)
{	uint8_t temp;
	LCD_CmdWrite(0x50);//BECR0
	temp = LCD_DataRead();
	temp |= cSetD6 ;
	LCD_DataWrite(temp);  
}

void BTE_rectangular_Data(void)
{	uint8_t temp;												   
	LCD_CmdWrite(0x50);//BECR0
	temp = LCD_DataRead();
	temp &= cClrD6 ;
	LCD_DataWrite(temp);  
}									  

//---------------------------------------------//
//REG[51h] 
void BTE_ROP_Code(uint8_t setx)
{	 
    LCD_CmdWrite(0x51);//BECR1	   
	LCD_DataWrite(setx); 
}									   

//---------------------------------------------//
//REG[52h] 
void Layer1_Visible(void)
{	uint8_t temp;
	LCD_CmdWrite(0x52);//LTPR0
	temp = LCD_DataRead();
	temp&=0xf8;
	LCD_DataWrite(temp);  
}

void Layer2_Visible(void)
{   uint8_t temp;
	LCD_CmdWrite(0x52);//LTPR0
	temp = LCD_DataRead();
	temp&=0xf8;
	temp|=0x01;
	LCD_DataWrite(temp);  
}	
						
void Transparent_Mode(void)
{	uint8_t temp;
	LCD_CmdWrite(0x52);//LTPR0
	temp = LCD_DataRead();
	temp&=0xf8;
	temp|=0x03;
	LCD_DataWrite(temp);  
}

void Lighten_Overlay_Mode(void)
{   uint8_t temp;
	LCD_CmdWrite(0x52);//LTPR0
	temp = LCD_DataRead();
	temp&=0xf8;
	temp|=0x02;
	LCD_DataWrite(temp);  
}	
						
void Boolean_OR(void)
{   uint8_t temp;
	LCD_CmdWrite(0x52);//LTPR0
	temp = LCD_DataRead();
	temp&=0xf8;
	temp|=0x04;
	LCD_DataWrite(temp);
}

void Boolean_AND(void)
{	uint8_t temp;
	LCD_CmdWrite(0x52);//LTPR0
	temp = LCD_DataRead();
	temp&=0xf8;
	temp|=0x05;
	LCD_DataWrite(temp);  
}  	 
	
  
void Floating_window_mode(void)
{	uint8_t temp;
	LCD_CmdWrite(0x52);//LTPR0
	temp = LCD_DataRead();
	temp&=0xf8;
	temp|=0x06;
	LCD_DataWrite(temp);  
} 

void Floating_Window_transparent_with_BGTR_enable(void)
{   uint8_t temp;
	LCD_CmdWrite(0x52);//LTPR0
	temp = LCD_DataRead();
	temp|=cSetD5;
	LCD_DataWrite(temp);  
}

void Floating_Window_transparent_with_BGTR_disable(void)
{   uint8_t temp;
	LCD_CmdWrite(0x52);//LTPR0
	temp = LCD_DataRead();
	temp&=cClrD5;
	LCD_DataWrite(temp);  
}


void Layer1_2_scroll(void)
{	uint8_t temp;
	LCD_CmdWrite(0x52);//LTPR0
	temp = LCD_DataRead();
	temp&=0x3f;
	LCD_DataWrite(temp);  
}  	 

void Layer1_scroll(void)
{	uint8_t temp;
	LCD_CmdWrite(0x52);//LTPR0
	temp = LCD_DataRead();
	temp&=0x3f;
	temp|=0x40;
	LCD_DataWrite(temp);  
} 

void Layer2_scroll(void)
{	uint8_t temp;
	LCD_CmdWrite(0x52);//LTPR0
	temp = LCD_DataRead();
	temp&=0x3f;
	temp|=0x80;
	LCD_DataWrite(temp);  
} 

void Buffer_scroll(void)
{	uint8_t temp;
	LCD_CmdWrite(0x52);//LTPR0
	temp = LCD_DataRead();
	temp&=0x3f;
	temp|=0xC0;
	LCD_DataWrite(temp);  
} 

//---------------------------------------------//
//REG[53h] 
void layer2_1_transparency(uint8_t setx)
{  
   LCD_CmdWrite(0x53);//LTPR1
   LCD_DataWrite(setx); 
}

//---------------------------------------------//
//REG[54h]~ [5Fh]
void BTE_Source_Destination	(uint16_t XL,uint16_t XR ,uint16_t YT ,uint16_t YB)
{
    uint8_t temp,temp1;
    
    temp=XL;   
    LCD_CmdWrite(0x54);//HSBE0
    LCD_DataWrite(temp);
    temp=XL>>8;   
    LCD_CmdWrite(0x55);//HSBE1	   
    LCD_DataWrite(temp);

