Vadim139/ARM/STM32F429/LCD_7in/src/RA8875_Driver.c
    temp=XR;   
    LCD_CmdWrite(0x58);//HDBE0
    LCD_DataWrite(temp);
    temp=XR>>8;   
    LCD_CmdWrite(0x59);//HDBE1	   
    LCD_DataWrite(temp); 
    
    temp=YT;   
    LCD_CmdWrite(0x56);//VSBE0
    LCD_DataWrite(temp);
    temp=YT>>8;   
    LCD_CmdWrite(0x57);//VSBE1
    temp1 = LCD_DataRead();
    temp1 &= 0x80;
    temp=temp|temp1; 
    LCD_CmdWrite(0x57);//VSBE1  
    LCD_DataWrite(temp);


    temp=YB;   
    LCD_CmdWrite(0x5a);//VDBE0
    LCD_DataWrite(temp);
    temp=YB>>8;   
    LCD_CmdWrite(0x5b);//VDBE1
    temp1 = LCD_DataRead();
    temp1 &= 0x80;
    temp=temp|temp1;	
    LCD_CmdWrite(0x5b);//VDBE1   
    LCD_DataWrite(temp);
}							

void Source_Layer1(void)
{   
    uint8_t temp;	
    LCD_CmdWrite(0x57);//VSBE1
    temp = LCD_DataRead();
    temp &= cClrD7 ;
    LCD_DataWrite(temp);
}

void Source_Layer2(void)
{	
    uint8_t temp;	
    LCD_CmdWrite(0x57);//VSBE1
    temp = LCD_DataRead();
    temp |= cSetD7 ;
    LCD_DataWrite(temp);
}

void Destination_Layer1(void)
{	
    uint8_t temp;	
    LCD_CmdWrite(0x5b);//VDBE1
    temp = LCD_DataRead();
    temp &= cClrD7 ;
    LCD_DataWrite(temp);
}

void Destination_Layer2(void)
{	
    uint8_t temp;	
    LCD_CmdWrite(0x5b);//VDBE1
    temp = LCD_DataRead();
    temp |= cSetD7 ;
    LCD_DataWrite(temp);
}
		  
//---------------------------------------------//
//---------------------------------------------//
void BTE_Size_setting(uint16_t X,uint16_t Y)
{	 
    LCD_CmdWrite(0x5c);//BEWR0
    LCD_DataWrite(X); 
    LCD_CmdWrite(0x5d);//BEWR1	   
    LCD_DataWrite(X>>8);
  
    LCD_CmdWrite(0x5e);//BEHR0
    LCD_DataWrite(Y);   
    LCD_CmdWrite(0x5f);//BEHR1	   
    LCD_DataWrite(Y>>8);
}									 

//---------------------------------------------//
//REG[60h]~REG[67h]

void Background_color(uint16_t color)
{
 #ifdef Color65k
    LCD_CmdWrite(0x60);
    LCD_DataWrite((color&0xf800)>>11);
	
    LCD_CmdWrite(0x61);
    LCD_DataWrite((color&0x07e0)>>5);
	
    LCD_CmdWrite(0x62);
    LCD_DataWrite((color&0x001f));
 #endif
	
 #ifdef Color256
    LCD_CmdWrite(0x60);
    LCD_DataWrite((color&0xf800)>>13);
	
    LCD_CmdWrite(0x61);
    LCD_DataWrite((color&0x07e0)>>8);
	
    LCD_CmdWrite(0x62);
    LCD_DataWrite((color&0x001f)>>3);
 #endif
}

 void Text_color(uint16_t color) 
{
 #ifdef Color65k
    LCD_CmdWrite(0x63);
    LCD_DataWrite((color&0xf800)>>11);
	
    LCD_CmdWrite(0x64);
    LCD_DataWrite((color&0x07e0)>>5);
	
    LCD_CmdWrite(0x65);
    LCD_DataWrite((color&0x001f));
 #endif
 
  #ifdef Color256
    LCD_CmdWrite(0x63);
    LCD_DataWrite((color&0xf800)>>13);
	
    LCD_CmdWrite(0x64);
    LCD_DataWrite((color&0x07e0)>>8);
	
    LCD_CmdWrite(0x65);
    LCD_DataWrite((color&0x001f)>>3);
 #endif
 
}

//--------------------------------------------//
void Text_Background_Color(uint8_t setR,uint8_t setG,uint8_t setB)
{
    LCD_CmdWrite(0x60);//BGCR0
    LCD_DataWrite(setR);
   
    LCD_CmdWrite(0x61);//BGCR0
    LCD_DataWrite(setG);

    LCD_CmdWrite(0x62);//BGCR0
    LCD_DataWrite(setB);
} 

void Text_Foreground_Color(uint8_t setR,uint8_t setG,uint8_t setB)
{	    
    LCD_CmdWrite(0x63);//BGCR0
    LCD_DataWrite(setR);
   
    LCD_CmdWrite(0x64);//BGCR0
    LCD_DataWrite(setG);

    LCD_CmdWrite(0x65);//BGCR0
    LCD_DataWrite(setB);

}


void BTE_Background_color(uint8_t setR,uint8_t setG,uint8_t setB)
{
    LCD_CmdWrite(0x60);//BGCR0
    LCD_DataWrite(setR);
    LCD_CmdWrite(0x61);//BGCR0
    LCD_DataWrite(setG);
    LCD_CmdWrite(0x62);//BGCR0
    LCD_DataWrite(setB);
}


void BTE_Foreground_color(uint8_t setR,uint8_t setG,uint8_t setB)
{
    LCD_CmdWrite(0x63);//BGCR0
    LCD_DataWrite(setR);
    LCD_CmdWrite(0x64);//BGCR0
    LCD_DataWrite(setG);
    LCD_CmdWrite(0x65);//BGCR0
    LCD_DataWrite(setB);
}


//======================================
//for test
void BTE_Background_red(uint8_t setx)
{	  
    LCD_CmdWrite(0x60);//BGCR0
    LCD_DataWrite(setx);
}	
						
void BTE_Background_green(uint8_t setx)
{	  
    LCD_CmdWrite(0x61);//BGCR1
    LCD_DataWrite(setx);
}							  

void BTE_Background_blue(uint8_t setx)
{	 
    LCD_CmdWrite(0x62);//BGCR2
    LCD_DataWrite(setx);
} 								

void BTE_Foreground_red(uint8_t setx)
{	
    LCD_CmdWrite(0x63);//FGCR0
    LCD_DataWrite(setx);
}								 

void BTE_Foreground_green(uint8_t setx)
{	  
    LCD_CmdWrite(0x64);//FGCR1
    LCD_DataWrite(setx);
}							 

void BTE_Foreground_blue(uint8_t setx)
{  
    LCD_CmdWrite(0x65);//FGCR2
    LCD_DataWrite(setx);
} 	

//======================================
	
void Pattern_Set_8x8(void)
{  uint8_t temp;

 LCD_CmdWrite(0x66);//PTNO
 temp = LCD_DataRead();
 temp &= cClrD7;
 LCD_DataWrite(temp);
}	

void Pattern_Set_16x16(void)
{  
    uint8_t  temp;
    LCD_CmdWrite(0x66);//PTNO
    temp = LCD_DataRead();
    temp |= cSetD7; 
    LCD_DataWrite(temp);
}								


void Pattern_Set_number(uint8_t setx)
{   
    uint8_t temp;    
    LCD_CmdWrite(0x66);//PTNO
    temp = LCD_DataRead();
    temp &= 0x80;    
    LCD_DataWrite(temp|setx);
} 	
							
void BackgroundColor_TransparentMode(uint8_t setR,uint8_t setG,uint8_t setB)
{
    LCD_CmdWrite(0x67);//BGTR_R
    LCD_DataWrite(setR);

    LCD_CmdWrite(0x68);//BGTR_G
    LCD_DataWrite(setG);

    LCD_CmdWrite(0x69);//BGTR_B
    LCD_DataWrite(setB);
}	  

//REG[70h]~REG[74h]
//==============================================================================
//Subroutine:	Enable_TP 
//==============================================================================
void Enable_TP(void)
{   
    uint8_t temp;	  
    LCD_CmdWrite(0x70);//TPCR0	
    temp = LCD_DataRead();
    temp |= cSetD7;   
    LCD_DataWrite(temp);
}
//==============================================================================
//Subroutine:	Disable_TP 
//==============================================================================
void Disable_TP(void)
{ 
    uint8_t temp;
    LCD_CmdWrite(0x70);//TPCR0
    temp = LCD_DataRead();
    temp &= cClrD7;   
    LCD_DataWrite(temp);
 }


//==============================================================================
//Subroutine:	Disable_Touch_WakeUp
//==============================================================================
void Disable_Touch_WakeUp(void)
{	
    uint8_t temp;
    LCD_CmdWrite(0x70);//TPCR0	
    temp = LCD_DataRead();
    temp &= cClrD3;
    LCD_DataWrite(temp);
}


//==============================================================================
//Subroutine:	Disable_Touch_WakeUp
//==============================================================================
void Enable_Touch_WakeUp(void)
{	
    uint8_t temp;
    LCD_CmdWrite(0x70);//TPCR0	
    temp = LCD_DataRead();
    temp &= cClrD3;
    LCD_DataWrite(temp);
}

//==============================================================================
//Subroutine:	TP manual or auto  mode enable
//==============================================================================
void TP_manual_mode(void)
{	
    uint8_t temp;
    LCD_CmdWrite(0x71);//TPCR1	
    temp = LCD_DataRead();
    temp |= cSetD6;
    LCD_DataWrite(temp);
}
void TP_auto_mode(void)
{	
    uint8_t temp;
    LCD_CmdWrite(0x71);//TPCR1	
    temp = LCD_DataRead();
    temp &= cClrD6;
    temp |= cSetD2;
    /********************/
    //temp |= 0x04;
    //temp |= 0x24;
    LCD_DataWrite(temp);
}
//==============================================================================
//Subroutine:	TP_IDLE_mode
//==============================================================================
void TP_IDLE_mode(void)
{ 
    uint8_t temp;
    LCD_CmdWrite(0x71);//TPCR1
    temp=LCD_DataRead(); 
    temp &= 0xf0;
    LCD_DataWrite(temp);
 }
//==============================================================================
//Subroutine:	TP_event_mode
//==============================================================================
void TP_event_mode(void)
{ 
    uint8_t temp;
    LCD_CmdWrite(0x71);//TPCR1
    temp=LCD_DataRead(); 
    temp &= 0xf0;
    temp |= 0x01;
    LCD_DataWrite(temp);
//  LCD_DataWrite(0xc1);
}
//==============================================================================
//Subroutine:	TP_latch_X
//==============================================================================
void TP_latch_X(void)
{ 
    uint8_t temp;
    LCD_CmdWrite(0x71);//TPCR1
    temp=LCD_DataRead(); 
    temp &= 0xe0;
    temp |= 0x02;
    LCD_DataWrite(temp);
 }
 //==============================================================================
//Subroutine:	TP_latch_Y
//==============================================================================
void TP_latch_Y(void)
{ 
    uint8_t temp;
    LCD_CmdWrite(0x71);//TPCR1
    temp=LCD_DataRead(); 
    temp &= 0xe0;
    temp |= 0x03;
    LCD_DataWrite(temp);
 }


// void TP_LDLE(void)
// {
//     uint8_t temp;
//     LCD_CmdWrite(0x71);//TPCR1
//     temp=LCD_DataRead(); 
//     temp &= 0xc0;
//     LCD_DataWrite(temp);
// }
//==============================================================================
//Subroutine:	Detect_TP_X_Y coordinate 
//==============================================================================
uint8_t ADC_X(void)
{	
    uint8_t temp;
    LCD_CmdWrite(0x72);//TPXH	 X_coordinate high byte
    //Chk_Busy();
    temp=LCD_DataRead();
    return temp;
}

uint8_t ADC_Y(void)
{	
    uint8_t temp;
    LCD_CmdWrite(0x73);//TPYH	  Y_coordinate high byte
    //Chk_Busy();
    temp=LCD_DataRead();
    return temp;
}

uint8_t ADC_XY(void)
{	
    uint8_t temp;
    LCD_CmdWrite(0x74);//TPXYL	  uint8_t[3:2] Y_coordinate low byte  uint8_t[1:0] X_coordinate low byte 
    temp=LCD_DataRead();
    return temp;
}   

//REG[80h]~REG[83h]
void Graphic_Cursor_Coordinate(uint16_t X,uint16_t Y)
{
    LCD_CmdWrite(0x80);
    LCD_DataWrite(X);  
    LCD_CmdWrite(0x81);	   
    LCD_DataWrite(X>>8);
  
    LCD_CmdWrite(0x82);
    LCD_DataWrite(Y);  
    LCD_CmdWrite(0x83);	   
    LCD_DataWrite(Y>>8);
}

//---------------------------------//
//REG[84h]

