Vadim139/ARM/STM32F429/LCD_7in/src/RA8875_Driver.c
void Graphic_Cursor_Color_0(uint8_t setx)
{	  
    LCD_CmdWrite(0x84);//GCC0
    LCD_DataWrite(setx); 
}  									  

void Graphic_Cursor_Color_1(uint8_t setx)
{	 
    LCD_CmdWrite(0x85);//GCC1
    LCD_DataWrite(setx); 
}  	
 	 						  
//---------------------------------------------//
//REG[8A]
void PWM1_enable(void)
{
    uint8_t temp;
    LCD_CmdWrite(0x8a);//MCLR
    temp = LCD_DataRead();
    temp |= cSetD7 ;
    LCD_DataWrite(temp);  
 }

void PWM1_disable(void)
{
    uint8_t temp;
    LCD_CmdWrite(0x8a);//MCLR
    temp = LCD_DataRead();
    temp &= cClrD7 ;
    LCD_DataWrite(temp);  
 }

void PWM1_disable_level_low(void)
{
    uint8_t temp;
    LCD_CmdWrite(0x8a);//MCLR
    temp = LCD_DataRead();
    temp &= cClrD6 ;
    LCD_DataWrite(temp);  
}

void PWM1_disable_level_high(void)
{
    uint8_t temp;
    LCD_CmdWrite(0x8a);//MCLR
    temp = LCD_DataRead();
    temp |= cSetD6 ;
    LCD_DataWrite(temp);  
}

 void PWM1_fnuction_sel(void)
{
    uint8_t temp;
    LCD_CmdWrite(0x8a);//MCLR
    temp = LCD_DataRead();
    temp &= cClrD4 ;
    LCD_DataWrite(temp);  
 }

 void PWM1_system_clk_out(void)
{
    uint8_t temp;
    LCD_CmdWrite(0x8a);//MCLR
    temp = LCD_DataRead();
    temp |= cSetD4 ;
    LCD_DataWrite(temp);  
 }

 void PWM1_clock_ratio(uint8_t setx) //bit0~3 
{
    uint8_t temp,temp1;
    temp1= setx&0x0f;
    LCD_CmdWrite(0x8a);//MCLR
    temp = LCD_DataRead();
    temp &= 0xf0;
    temp |= temp1 ;
    LCD_DataWrite(temp);  
 }

 void PWM1_duty_cycle(uint8_t setx) //bit0~7
{
  
    LCD_CmdWrite(0x8b);//PTNO
    LCD_DataWrite(setx);
} 	

void PWM2_enable(void)
{
    uint8_t temp;
    LCD_CmdWrite(0x8c);//MCLR
    temp = LCD_DataRead();
    temp |= cSetD7 ;
    LCD_DataWrite(temp);  
 }

void PWM2_disable(void)
{
    uint8_t temp;
    LCD_CmdWrite(0x8c);//MCLR
    temp = LCD_DataRead();
    temp &= cClrD7 ;
    LCD_DataWrite(temp);  
 }

void PWM2_disable_level_low(void)
{
    uint8_t temp;
    LCD_CmdWrite(0x8c);//MCLR
    temp = LCD_DataRead();
    temp &= cClrD6 ;
    LCD_DataWrite(temp);  
}

void PWM2_disable_level_high(void)
{
    uint8_t temp;
    LCD_CmdWrite(0x8c);//MCLR
    temp = LCD_DataRead();
    temp |= cSetD6 ;
    LCD_DataWrite(temp);  
}

 void PWM2_fnuction_sel(void)
{
    uint8_t temp;
    LCD_CmdWrite(0x8c);//MCLR
    temp = LCD_DataRead();
    temp &= cClrD4 ;
    LCD_DataWrite(temp);  
 }

  void PWM2_system_clk_out(void)
{
    uint8_t temp;
    LCD_CmdWrite(0x8c);//MCLR
    temp = LCD_DataRead();
    temp |= cSetD4 ;
    LCD_DataWrite(temp);  
 }

  void PWM2_clock_ratio(uint8_t setx) //bit0~3 
{
    uint8_t temp,temp1;
    temp1= setx&0x0f;
    LCD_CmdWrite(0x8c);//MCLR
    temp = LCD_DataRead();
    temp &= 0xf0;
    temp |= temp1 ;
    LCD_DataWrite(temp);  
 }
 void PWM2_duty_cycle(uint8_t setx) //bit0~7
{  
    LCD_CmdWrite(0x8d);//PTNO
    LCD_DataWrite(setx);
} 	


//---------------------------------------------//
//REG[8Eh]
void Stop_Memory_Clear(void)
{
	uint8_t temp;
	LCD_CmdWrite(0x8e);//MCLR
	temp = LCD_DataRead();
	temp &= cClrD7 ;
	LCD_DataWrite(temp);  
}						 
void Memory_Clear(void)
{
	uint8_t temp;
	LCD_CmdWrite(0x8e);//MCLR
	temp = LCD_DataRead();
	temp |= cSetD7 ;
	LCD_DataWrite(temp); 
	Chk_Busy(); 
}
void Clear_Full_Window(void)
{
	uint8_t temp;
	LCD_CmdWrite(0x8e);//MCLR
	temp = LCD_DataRead();
	temp &= cClrD6 ;
	LCD_DataWrite(temp);  
}
void Clear_Active_Window(void)
{
	uint8_t temp;
	LCD_CmdWrite(0x8e);//MCLR
	temp = LCD_DataRead();
	temp |= cSetD6 ;
	LCD_DataWrite(temp);  
}

									
//---------------------------------------------//
//REG[90h] 
void Draw_line(void)
{ 
  LCD_CmdWrite(0x90);//DCR
  LCD_DataWrite(0x00);
  LCD_DataWrite(0x80);
}

void Draw_square(void)
{
  LCD_CmdWrite(0x90);//DCR
  LCD_DataWrite(0x10);
  LCD_DataWrite(0x90);
}

void Draw_square_fill(void)
{
  LCD_CmdWrite(0x90);//DCR
  LCD_DataWrite(0x10);
  LCD_DataWrite(0xb0);
}

void Draw_circle(void)
{
  LCD_CmdWrite(0x90);//DCR
  LCD_DataWrite(0x40);
}

void Draw_circle_fill(void)
{
  LCD_CmdWrite(0x90);//DCR
  LCD_DataWrite(0x60);
}

void Draw_Triangle(void)
{
   LCD_CmdWrite(0x90);//DCR
   LCD_DataWrite(0x00);
   LCD_DataWrite(0x81);
}

void Draw_Triangle_fill(void)
{
   LCD_CmdWrite(0x90);//DCR
   LCD_DataWrite(0x01);
   LCD_DataWrite(0xA1);
}

//---------------------------------------------//
//REG[90h]~/EG[9Dh]  									
void Geometric_Coordinate(uint16_t X,uint16_t Y,uint16_t X1  ,uint16_t Y1)
{	 
    LCD_CmdWrite(0x91);
    LCD_DataWrite(X);   
    LCD_CmdWrite(0x92);	   
    LCD_DataWrite(X>>8);
	
    LCD_CmdWrite(0x93);
    LCD_DataWrite(Y);  
    LCD_CmdWrite(0x94);	   
    LCD_DataWrite(Y>>8);
	
    LCD_CmdWrite(0x95);
    LCD_DataWrite(X1);  
    LCD_CmdWrite(0x96);	   
    LCD_DataWrite(X1>>8);
	     

   
    LCD_CmdWrite(0x97);
    LCD_DataWrite(Y1);   
    LCD_CmdWrite(0x98);	   
    LCD_DataWrite(Y1>>8);
}

 

//---------------------------------------------//
//REG[A0h] 
void Draw_Ellipse(void)
{
   LCD_CmdWrite(0xA0);//DCR
   LCD_DataWrite(0x00);
   LCD_DataWrite(0x80);
}
void Draw_Ellipse_fill(void)
{
   LCD_CmdWrite(0xA0);//DCR
   LCD_DataWrite(0x40);
   LCD_DataWrite(0xC0);
}
void Draw_Ellipse_Curve(void)
{  
   uint8_t temp;
   LCD_CmdWrite(0xA0);//DCR
   temp = LCD_DataRead();
   temp &=0x1F;
   temp |= 0x90;
   LCD_DataWrite(temp);
}

void Draw_Ellipse_Curve_Fill(void)
{  
   uint8_t temp;
   LCD_CmdWrite(0xA0);//DCR
   temp = LCD_DataRead();
   temp &=0x1F;
   temp |= 0xD0;
   LCD_DataWrite(temp);
}

void Draw_Ellipse_Curve_part(uint8_t setx)
{
   uint8_t temp,temp1;
   LCD_CmdWrite(0xA0);//DCR
   temp = LCD_DataRead();
   temp1 = setx&0x03;
   temp &=0xfc;
   temp |=temp1;
   LCD_DataWrite(temp);   
}

void Draw_Circle_Square(void)
{
   LCD_CmdWrite(0xA0);//DCR
   LCD_DataWrite(0x20);
   LCD_DataWrite(0xA0);
}

void Draw_Circle_Square_fill(void)
{
   LCD_CmdWrite(0xA0);//DCR
   LCD_DataWrite(0x60);
   LCD_DataWrite(0xE0);
}

/******************************************************************************
* Function Name  : Circle_Coordinate_Radius
* Description    : Geometric Pattern Drawing Engine :Circle Of Circlar Corner Input 
* Input          : - X:
*                  - Y:
*       				   - R
* Output         : None
* Return         : None
* Attention		   : None
*******************************************************************************/	
void Circle_Coordinate_Radius(uint16_t X,uint16_t Y,uint16_t R)
{
      
    LCD_CmdWrite(0x99);
    LCD_DataWrite(X);  
    LCD_CmdWrite(0x9a);	   
    LCD_DataWrite(X>>8);  
	   
    LCD_CmdWrite(0x9b);
    LCD_DataWrite(Y); 
    LCD_CmdWrite(0x9c);	   
    LCD_DataWrite(Y>>8);
 
