Vadim139/ARM/STM32F429/LCD_7in/src/RA8875_Driver.c
    LCD_CmdWrite(0x9d);
    LCD_DataWrite(R);
}
/******************************************************************************
* Function Name  : Ellipse_Coordinate_setting
* Description    : Geometric Pattern Drawing Engine :Ellipse Of Circlar Corner Input 
* Input          : - X:
*                  - Y:
*       				   - ELL_A:Long axis
*       		       - ELL_B:short axis
* Output         : None
* Return         : None
* Attention		   : None
*******************************************************************************/	
void Ellipse_Coordinate_setting(uint16_t X,uint16_t Y,uint16_t ELL_A,uint16_t ELL_B)
{

    LCD_CmdWrite(0xA5);
    LCD_DataWrite(X);
    LCD_CmdWrite(0xA6);	   
    LCD_DataWrite(X>>8);  
	   
    LCD_CmdWrite(0xA7);
    LCD_DataWrite(Y); 
    LCD_CmdWrite(0xA8);	   
    LCD_DataWrite(Y>>8);
  
    LCD_CmdWrite(0xA1);
    LCD_DataWrite(ELL_A);
    LCD_CmdWrite(0xA2);
    LCD_DataWrite(ELL_A>>8);
  
    LCD_CmdWrite(0xA3);
    LCD_DataWrite(ELL_B);
    LCD_CmdWrite(0xA4);
    LCD_DataWrite(ELL_B>>8);
} 


/******************************************************************************
* Function Name  : Circle_Square_Coordinate_setting
* Description    : Geometric Pattern Drawing Engine :Square Of Circlar Corner Input 
* Input          : - x0:
*                  - y0:
*       				   - x1:
*       		       - y1:
*       				   - ELL_A:Long axis
*       		       - ELL_B:short axis
* Output         : None
* Return         : None
* Attention		   : None
*******************************************************************************/	
void Circle_Square_Coordinate_setting(uint16_t X0,uint16_t Y0 ,uint16_t X1 ,uint16_t Y1 ,uint16_t ELL_A,uint16_t ELL_B)
{	    
  
    LCD_CmdWrite(0x91);
    LCD_DataWrite(X0);  
    LCD_CmdWrite(0x92);	   
    LCD_DataWrite(X0>>8);

		     
    LCD_CmdWrite(0x93);
    LCD_DataWrite(Y0);  
    LCD_CmdWrite(0x94);	   
    LCD_DataWrite(Y0>>8);
	
    LCD_CmdWrite(0x95);
    LCD_DataWrite(X1);   
    LCD_CmdWrite(0x96);	   
    LCD_DataWrite(X1>>8);


    LCD_CmdWrite(0x97);
    LCD_DataWrite(Y1);  
    LCD_CmdWrite(0x98);	   
    LCD_DataWrite(Y1>>8);
  
    LCD_CmdWrite(0xA1);
    LCD_DataWrite(ELL_A);
    LCD_CmdWrite(0xA2);
    LCD_DataWrite(ELL_A>>8);
 
    LCD_CmdWrite(0xA3);
    LCD_DataWrite(ELL_B);
    LCD_CmdWrite(0xA4);
    LCD_DataWrite(ELL_B>>8); 
}

/******************************************************************************
* Function Name  : Draw_Triangle_3point_Coordinate
* Description    : Geometric Pattern Drawing Engine :Triangle Of Circlar Corner Input 
* Input          : - P1_X:
*                  - P1_Y:
*       				   - P2_X
*       		       - P2_Y
*       				   - P3_X
*       		       - P3_Y
* Output         : None
* Return         : None
* Attention		   : None
*******************************************************************************/	 
void Draw_Triangle_3point_Coordinate(uint16_t P1_X,uint16_t P1_Y,uint16_t P2_X,uint16_t P2_Y,uint16_t P3_X,uint16_t P3_Y)
{	    
  
    LCD_CmdWrite(0x91);
    LCD_DataWrite(P1_X);  
    LCD_CmdWrite(0x92);	   
    LCD_DataWrite(P1_X>>8);
  
    LCD_CmdWrite(0x93);
    LCD_DataWrite(P1_Y);  
    LCD_CmdWrite(0x94);	   
    LCD_DataWrite(P1_Y>>8);
 
    LCD_CmdWrite(0x95);
    LCD_DataWrite(P2_X);  
    LCD_CmdWrite(0x96);	   
    LCD_DataWrite(P2_X>>8);
 
    LCD_CmdWrite(0x97);
    LCD_DataWrite(P2_Y);  
    LCD_CmdWrite(0x98);	   
    LCD_DataWrite(P2_Y>>8);

    LCD_CmdWrite(0xA9);
    LCD_DataWrite(P3_X);  
    LCD_CmdWrite(0xAA);	   
    LCD_DataWrite(P3_X>>8);
  
    LCD_CmdWrite(0xAB);
    LCD_DataWrite(P3_Y);   
    LCD_CmdWrite(0xAC);	   
    LCD_DataWrite(P3_Y>>8);   
}

//---------------------------------------------//
//REG[B0]~REG[B3]
void DMA_Start_address_setting(uint32_t set_address)
{ 
   LCD_CmdWrite(0xB0);
   LCD_DataWrite(set_address);

   LCD_CmdWrite(0xB1);
   LCD_DataWrite(set_address>>8);

   LCD_CmdWrite(0xB2);
   LCD_DataWrite(set_address>>16);

   LCD_CmdWrite(0xB3);
   LCD_DataWrite(set_address>>24);

}

//input pic data quantity  for example  pic size = 800*480 = 384000
void DMA_Continuous_mode_size_setting(uint32_t set_size)
{ 
   LCD_CmdWrite(0xB4);
   LCD_DataWrite(set_size);

   LCD_CmdWrite(0xB6);
   LCD_DataWrite(set_size>>8);
 
   LCD_CmdWrite(0xB8);
   LCD_DataWrite(set_size>>16);
}

void DMA_block_mode_size_setting(uint16_t BWR,uint16_t BHR,uint16_t SPWR)
{
   LCD_CmdWrite(0xB4);
   LCD_DataWrite(BWR);
   LCD_CmdWrite(0xB5);
   LCD_DataWrite(BWR>>8);

   LCD_CmdWrite(0xB6);
   LCD_DataWrite(BHR);
   LCD_CmdWrite(0xB7);
   LCD_DataWrite(BHR>>8);

   LCD_CmdWrite(0xB8);
   LCD_DataWrite(SPWR);
   LCD_CmdWrite(0xB9);
   LCD_DataWrite(SPWR>>8);  
}

//---------------------------------------------//
//REG[BFh]
void DMA_Continuous_mode(void)
{ 
   LCD_CmdWrite(0xBF);
   LCD_DataWrite(0x00);
}

void DMA_Block_mode(void)
{ 
   LCD_CmdWrite(0xBF);
   LCD_DataWrite(0x02);
}

void DMA_Start_enable(void)
{  
   uint8_t temp;
   LCD_CmdWrite(0xBF);
   temp = LCD_DataRead();
   temp |= 0x01;
   LCD_DataWrite(temp);
}

//---------------------------------------------//
//REG[C0h]
void Key_Scan_Enable(void)
{ 
  uint8_t temp;
  LCD_CmdWrite(0xC0);
  temp = LCD_DataRead();
  temp |= 0x80;
  LCD_DataWrite(temp);  
}


void Key_Scan_setting(uint8_t setx)//uint8_t[2:0]
{ 
  uint8_t temp;
  LCD_CmdWrite(0xC0);
  temp = LCD_DataRead();
  temp &= 0xf0;
  temp|= (setx&0x07);
  LCD_DataWrite(temp);  
} 

void Long_Key_Scan_enable(void)
{ 
  uint8_t temp;
  LCD_CmdWrite(0xC0);
  temp = LCD_DataRead();
  temp |= 0x40;
  LCD_DataWrite(temp);
}

void Key_Scan_Wakeup_Function_Enable(void)
{ 
  uint8_t temp;
  LCD_CmdWrite(0xC1);	
  temp = LCD_DataRead();
  temp |= 0x80;	// 
  LCD_DataWrite(temp);
}

void Long_Key_Timing_Adjustment(uint8_t setx)
{
  uint8_t temp,temp1;
  temp = setx & 0x1c;
  LCD_CmdWrite(0xC1);
  temp1 = LCD_DataRead();
  temp1|=temp;
  LCD_DataWrite(temp1);   
 
}

//---------------------------------------------//
//REG[D0]
void Floating_window_start_point(uint16_t X,uint16_t Y)
{ 
   LCD_CmdWrite(0xD0);
   LCD_DataWrite(X);
   LCD_CmdWrite(0xD1);
   LCD_DataWrite(X>>8);

   LCD_CmdWrite(0xD2);
   LCD_DataWrite(Y);
   LCD_CmdWrite(0xD3);
   LCD_DataWrite(Y>>8);  
}


void Floating_window_size(uint16_t width_X,uint16_t high_Y)
{

   LCD_CmdWrite(0xD4);
   LCD_DataWrite(width_X);
   LCD_CmdWrite(0xD5);
   LCD_DataWrite(width_X>>8);

   LCD_CmdWrite(0xD6);
   LCD_DataWrite(high_Y);
   LCD_CmdWrite(0xD7);
   LCD_DataWrite(high_Y>>8);

