Vadim139/ARM/STM32F429/LCD_7in/src/RA8875_Driver.c
}

void Floating_window_display_point(uint16_t X,uint16_t Y)
{

   LCD_CmdWrite(0xD8);
   LCD_DataWrite(X);
   LCD_CmdWrite(0xD9);
   LCD_DataWrite(X>>8);

   LCD_CmdWrite(0xDA);
   LCD_DataWrite(Y);
   LCD_CmdWrite(0xDB);
   LCD_DataWrite(Y>>8);

}


//REG[E0h] 
void Serial_ROM_direct_access_mode_enable(void)
{
   LCD_CmdWrite(0xE0);
   LCD_DataWrite(0x01);
}

void Serial_ROM_direct_access_mode_disable(void)
{
   LCD_CmdWrite(0xE0);
   LCD_DataWrite(0x00);
}

void Direct_access_mode_Address_32bits(uint32_t set_address)
{
  uint8_t temp;  
  temp = set_address>>24;
  LCD_CmdWrite(0xE1);
  LCD_DataWrite(temp);
  temp = set_address>>16;
  LCD_DataWrite(temp);
  temp = set_address>>8;
  LCD_DataWrite(temp);
  temp = set_address;
  LCD_DataWrite(temp);

}

void Direct_access_mode_Address_24bits(uint32_t set_address)
{
  uint8_t temp=0;
  
  temp = set_address>>16;
  LCD_CmdWrite(0xE1);
  LCD_DataWrite(temp);  
  temp = set_address>>8;
  LCD_CmdWrite(0xE1);
  LCD_DataWrite(temp);   
  temp = set_address;
  LCD_CmdWrite(0xE1);
  LCD_DataWrite(temp);

}

uint8_t Direct_access_mode_Read_Data_buffer(void)
{
   uint8_t Serial_Data;
   LCD_CmdWrite(0xE2);
   Serial_Data=LCD_DataRead(); 
   return Serial_Data;
}

//---------------------------------------------//



//---------------------------------------------//
//REG[F0h] 

void KEYSCAN_Interrupt_Enable(void)
{ 
  uint8_t temp;
  LCD_CmdWrite(0xF0);	
  temp = LCD_DataRead();
  temp |= 0x10;	// 
  LCD_DataWrite(temp); 
}

void KEYSCAN_Interrupt_Disable(void)
{ 
  uint8_t temp;
  LCD_CmdWrite(0xF0);	
  temp = LCD_DataRead();
  temp &= 0x0F;	// 
  LCD_DataWrite(temp); 
}


void DMA_Interrupt_Enable(void)
{ 
  uint8_t temp;
  LCD_CmdWrite(0xF0);	
  temp = LCD_DataRead();
  temp |= 0x08;	// 
  LCD_DataWrite(temp); 
}

void DMA_Interrupt_Disable(void)
{ 
  uint8_t temp;
  LCD_CmdWrite(0xF0);	
  temp = LCD_DataRead();
  temp &= 0x17;	// 
  LCD_DataWrite(temp); 
}

void Touch_Panel_Interrupt_Enable(void)
{
  uint8_t temp;
  LCD_CmdWrite(0xF0);//INTC
  temp=LCD_DataRead(); 
  temp |= 0x04;
  LCD_DataWrite(temp);
 }

void Touch_Panel_Interrupt_Disable(void)
{ 
  uint8_t temp;
  LCD_CmdWrite(0xF0);//INTC
  temp=LCD_DataRead(); 
  temp &= 0x1B;
  LCD_DataWrite(temp);
 }

void BTE_Interrupt_Enable(void)
{
  uint8_t temp;
  LCD_CmdWrite(0xF0);//INTC
  temp=LCD_DataRead(); 
  temp |= 0x02;
  LCD_DataWrite(temp);
}

void BTE_Interrupt_Disable(void)
{
  uint8_t temp;
  LCD_CmdWrite(0xF0);//INTC
  temp=LCD_DataRead(); 
  temp &= 0x1D;
  LCD_DataWrite(temp);
}

void Font_BTE_read_write_Interrupt_Enable(void)
{
  uint8_t temp;
  LCD_CmdWrite(0xF0);//INTC
  temp=LCD_DataRead(); 
  temp |= 0x01;
  LCD_DataWrite(temp);
}

void Font_BTE_read_write_Interrupt_Disable(void)
{
  uint8_t temp;
  LCD_CmdWrite(0xF0);//INTC
  temp=LCD_DataRead(); 
  temp &= 0x1E;
  LCD_DataWrite(temp);
}

//---------------------------------------------//
//REG[F1h] 
void Clear_keyscan_interrupt(void)
{ uint8_t temp;
  LCD_CmdWrite(0xF1);//INTC
  temp=LCD_DataRead(); 
  temp |=cSetD4 ;
  LCD_DataWrite(temp);
}

uint8_t Keyscan_Status(void)
{   
  uint8_t temp;
  LCD_CmdWrite(0xF1);//INTC	
  temp = LCD_DataRead();
  if ((temp&0x10)==0x10)
     return 1;
  else 
     return 0;
}

void Clear_DMA_interrupt(void)
{ 
  uint8_t temp;
  LCD_CmdWrite(0xF1);//INTC
  temp=LCD_DataRead(); 
  temp |=cSetD3 ;
  LCD_DataWrite(temp);
}

uint8_t DMA_Status(void)
{   
  uint8_t temp;
  LCD_CmdWrite(0xF1);//INTC	
  temp = LCD_DataRead();
  if ((temp&0x08)==0x08)
    return 1;
  else 
    return 0;
}

void clear_TP_interrupt(void)
{ 
  uint8_t temp;
  LCD_CmdWrite(0xF1);//INTC
  temp=LCD_DataRead(); 
  temp |= cSetD2;
  LCD_DataWrite(temp);
 }


uint8_t Touch_Status(void)
{	
  uint8_t temp;
  LCD_CmdWrite(0xF1);//INTC	
  temp = LCD_DataRead();
  if ((temp&0x04)==0x04)
    return 1;
  else 
    return 0;
}

void Clear_BTE_interrupt(void)
{ 
  uint8_t temp;
  LCD_CmdWrite(0xF1);//INTC
  temp=LCD_DataRead(); 
  temp |= cSetD1;
  LCD_DataWrite(temp);
}

uint8_t BTE_Status(void)
{	
  uint8_t temp;
  LCD_CmdWrite(0xF1);//INTC	
  temp = LCD_DataRead();
  if ((temp&0x02)==0x02)
    return 1;
  else 
    return 0;
}

void Clear_Font_BTE_read_write_Interrupt(void)
{ 
  uint8_t temp;
  LCD_CmdWrite(0xF1);//INTC
  temp=LCD_DataRead(); 
  temp |= cSetD0;
  LCD_DataWrite(temp);
}

uint8_t Font_BTE_read_write_Status(void)
{	
  uint8_t temp;
  LCD_CmdWrite(0xF1);//INTC	
  temp = LCD_DataRead();
  if ((temp&0x01)==0x01)
    return 1;
  else 
    return 0;
}


void Chk_Wait(void)
{
 //while(MCU_WAIT==0);	   
}

void Show_String(const char *str,uint8_t n)
{   
  Text_Mode();
  LCD_CmdWrite(0x02);
  while(*str != '\0')
  {

	  if(*str == -71)
		  LCD_DataWrite(*str-8);
	  else if(*str == -97)
		  LCD_DataWrite(*str+29);
	  else if(*str == -100)
		  LCD_DataWrite(*str+26);
	  else
		  LCD_DataWrite(*str);
     ++str;	 	
     Chk_Busy();
     //Chk_Wait();		
   }
}


void LCD_Reset(void)
{
	//GPIOA->BRR  = GPIO_Pin_3; //RA8875 RESET pin
	//delay_ms(110);
	//GPIOA->BSRR  = GPIO_Pin_3;
	//delay_ms(110);
}

/*******************************************************************************
* Function Name  : LcdClear
* Description    : Clear the screen  
* Input          : Color: Screen Color
* Output         : None
* Return         : None
* Attention		   : None
*******************************************************************************/
void LcdClear(u16 color)
{
	Text_color(color); // Set the color
	Geometric_Coordinate(0,0,800,479);
	LCD_CmdWrite(0x90);
	LCD_DataWrite(0xB0);

	LCD_CmdWrite(0x01);//Display on
	LCD_DataWrite(0x80);
}

/*******************************************************************************
* Function Name  : lcd_drawpoint
* Description    : Dot on the LCD 
* Input          : x：X coordinate
									 x：X coordinate
                   Color: point Color
* Output         : None
* Return         : None
* Attention		   : None
*******************************************************************************/
void Lcd_DrawPoint(u16 x, u16 y, u16 color)
{
    Text_color(color); // Set the color
    LCD_CmdWrite(0x99);
    LCD_DataWrite(x);  
    LCD_CmdWrite(0x9a);	   
    LCD_DataWrite(x>>8);  
	
    LCD_CmdWrite(0x9b);
    LCD_DataWrite(y); 
    LCD_CmdWrite(0x9c);	   
    LCD_DataWrite(y>>8);
 
