Vadim139/ARM/STM32F429/LCD_7in/src/RA8875_Driver.c
    LCD_CmdWrite(0x9d);
    LCD_DataWrite(0X01);
		Draw_circle_fill();
}	

/******************************************************************************
* Function Name  : LCD_DrawCircle
* Description    : Bresenham's line algorithm :Circle Input 
* Input          : - x0:
*                  - y0:
*       				   - x1:
*       		       - y1:
*                  - color:
*                  - fill :Whether can fill
										This parameter can be: ENABLE or DISABLE.
* Output         : None
* Return         : None
* Attention		 : None
*******************************************************************************/	 
void LCD_DrawCircle( uint16_t x, uint16_t y, uint16_t r , uint16_t color , uint16_t fill )
{
		Circle_Coordinate_Radius(x,y,r);
	  Text_color(color); // Set the color
		if (fill != DISABLE)
			Draw_circle_fill();		
		else 
			Draw_circle();
}

/******************************************************************************
* Function Name  : LCD_DrawEllipse
* Description    : Bresenham's line algorithm :Ellipse Input 
* Input          : - x0:
*                  - y0:
*       				   - x1:
*       		       - y1:
*                  - color:
*                  - fill :Whether can fill
										This parameter can be: ENABLE or DISABLE.
* Output         : None
* Return         : None
* Attention		 : None
*******************************************************************************/	 
void LCD_DrawEllipse( uint16_t x, uint16_t y, uint16_t Long_axis , uint16_t Short_axis,uint16_t color , uint16_t fill )
{
	
		Ellipse_Coordinate_setting(x,y,Long_axis,Short_axis);
	  Text_color(color); // Set the color
		if (fill != DISABLE)
			Draw_Ellipse_fill();			
		else
			Draw_Ellipse();
}


/******************************************************************************
* Function Name  : LCD_DrawCurve
* Description    : Bresenham's line algorithm :Curve Input  
* Input          : - x0:
*                  - y0:
*       				   - x1:
*       		       - y1:
*                  - color:
*									 - part
										 00:	lowe left 
										 01:	upper left
										 02:	upper right(RU)
										 03:	low right
*                  - fill :Whether can fill
										This parameter can be: ENABLE or DISABLE.
* Output         : None
* Return         : None
* Attention		 : None
*******************************************************************************/	 
void LCD_DrawCurve( uint16_t x, uint16_t y, uint16_t Long_axis , uint16_t Short_axis,uint16_t color ,uint16_t part, uint16_t fill )
{
		Ellipse_Coordinate_setting(x,y,Long_axis,Short_axis);
	  Text_color(color); // Set the color
		Draw_Ellipse_Curve_part(part);
		if (fill != DISABLE)
			Draw_Ellipse_Curve_Fill();			
		else
			Draw_Ellipse_Curve();
}


/******************************************************************************
* Function Name  : LCD_DrawSquare
* Description    : Bresenham's line algorithm :Curve Input  
* Input          : - x0:
*                  - y0:
*       				   - x1:
*       		       - y1:
*                  - color:
*                  - fill :Whether can fill
										This parameter can be: ENABLE or DISABLE.
* Output         : None
* Return         : None
* Attention		 : None
*******************************************************************************/	 
void LCD_DrawSquare( uint16_t x0, uint16_t y0, uint16_t x1 , uint16_t y1,uint16_t color , uint16_t fill )
{

		Geometric_Coordinate(x0,y0,x1,y1);
	  Text_color(color); // Set the color	
		if (fill != DISABLE)
			Draw_square_fill();	
		else 
			Draw_square();		
}

/******************************************************************************
* Function Name  : LCD_DrawLine
* Description    : Geometric Pattern Drawing Engine :
* Input          : - x0:
*                  - y0:
*       				   - x1:
*       		       - y1:
*                  - color:
* Output         : None
* Return         : None
* Attention		 : None
*******************************************************************************/	 
void LCD_DrawLine( uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1 , uint16_t color )
{
		Geometric_Coordinate(x0,y0,x1,y1);
	  Text_color(color); // 设定颜色 	
    Draw_line();
}

/******************************************************************************
* Function Name  : LCD_DrawTriangle
* Description    : Geometric Pattern Drawing Engine 
* Input          : - x0:
*                  - y0:
*       				   - x1:
*       		       - y1:
*       				   - x2:
*       		       - y2:
*                  - color:
*                  - fill :Whether can fill
										This parameter can be: ENABLE or DISABLE.
* Output         : None
* Return         : None
* Attention		   : None
*******************************************************************************/	 
void LCD_DrawTriangle( uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1 , uint16_t x2, uint16_t y2 ,uint16_t color, uint16_t fill )
{	
		Draw_Triangle_3point_Coordinate(x0,y0,x1,y1,x2,y2);
	  Text_color(color); // Set the color
		if (fill != DISABLE)
			Draw_Triangle_fill();			
		else
			Draw_Triangle(); 
}

/******************************************************************************
* Function Name  : LCD_DrawCircleSquare
* Description    : Geometric Pattern Drawing Engine :Square Of Circlar Corner Input 
* Input          : - x0:
*                  - y0:
*       				   - x1:
*       		       - y1:
*       				   - x2:
*       		       - y2:
*                  - color:
*                  - fill :Whether can fill
										This parameter can be: ENABLE or DISABLE.
* Output         : None
* Return         : None
* Attention		   : None
*******************************************************************************/	 
void LCD_DrawCircleSquare( uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1 , uint16_t Long_axis , uint16_t Short_axis,uint16_t color, uint16_t fill )
{	
		Circle_Square_Coordinate_setting(x0,y0,x1,y1,Long_axis,Short_axis);	
	  Text_color(color); // Set the color
		if (fill != DISABLE)
		{
				Draw_Circle_Square_fill();			
		}
		else
		{
				Draw_Circle_Square();
		}
    
