Vadim139/ARM/STM32F429/LCD_7in/src/RA8875_Driver.c
}

/******************************************************************************
* Function Name  : LCD_Internal_Font_ROM
* Description    : The RA8875 embedded 8x16 dots ASCII Font ROM that provides user a convenient way to 
									input characters by code. The embedded character set supports ISO/IEC 8859-1~4 coding 
									standard. Besides, user can choose the font foreground color by setting the REG[60h~62h] and 
									background color by setting the REG[63h~65h]. For the procedure of characters writing please 
									refers to below figure:  
* Input          : - x0:
*                  - y0:
*       				   - Foreground_color:
*       		       - Background_color:
*       				   - Alignment:
											0 : Full alignment is disable. 
											1 : Full alignment is enable. 
*       		       - Transparency:
											0 : Font with background color.  
											1 : Font with background transparency. 
*                  - zoom:
											1 : X1. 
											2 : X2. 
											3 : X3.
											4 : X4.
*                  - turning :Whether can fill
											0 : Normal.  
											1 : 90 degree display.  
* Output         : None
* Return         : None
* Attention		   : None
*******************************************************************************/	
void LCD_Internal_Font_ROM(uint16_t x0, uint16_t y0,uint16_t Foreground_color,uint16_t Background_color,uint16_t Alignment,uint16_t Transparency, uint16_t zoom,uint16_t turning)
{
	Text_Mode();
	Internal_CGROM();
	Font_Coordinate(x0,y0);
	
/******** Font foreground and background color Select   *******/		
	Text_Foreground_Color((Foreground_color&0xf800)>>11 ,(Foreground_color&0x07e0)>>5,(Foreground_color&0x001f));
	Text_Background_Color((Background_color&0xf800)>>11 ,(Background_color&0x07e0)>>5,(Background_color&0x001f));
	
/******************** Font Transparency  *********************/	
	if(Alignment) 
		No_FullAlignment();
	else 
		FullAlignment();	
	
/**************** Full Alignment Selection Bit   **************/	
	if(Transparency) 
		Font_with_BackgroundTransparency();
	else 
		Font_with_BackgroundColor();	
	
/**************** Enlargement, Transparent Font   ***************/	
	switch (zoom)
	{
		case 0:
						Horizontal_FontEnlarge_x1();
					 Vertical_FontEnlarge_x1();
		break;
		case 1:Horizontal_FontEnlarge_x1();
					 Vertical_FontEnlarge_x1();
			break;
		case 2:Horizontal_FontEnlarge_x2();
					 Vertical_FontEnlarge_x2();
			break;
		case 3:Horizontal_FontEnlarge_x3();
					 Vertical_FontEnlarge_x3();
		break;
		case 4:Horizontal_FontEnlarge_x4();
					 Vertical_FontEnlarge_x4();
		break;
		default:
			break;
	}
/*********************** 90 Degree Font  **********************/	
	if(turning) 
		Rotate90_Font();
	else 
		NoRotate_Font();
	
}
/******************************************************************************
* Function Name  : LCD_External_Font_ROM
* Description    : The RA8875 embedded 8x16 dots ASCII Font ROM that provides user a convenient way to 
									input characters by code. The embedded character set supports ISO/IEC 8859-1~4 coding 
									standard. Besides, user can choose the font foreground color by setting the REG[60h~62h] and 
									background color by setting the REG[63h~65h]. For the procedure of characters writing please 
									refers to below figure:  
* Input          : - x0:
*                  - y0:
*       				   - Foreground_color:
*       		       - Background_color:
*       				   - Alignment:
											0 : Full alignment is disable. 
											1 : Full alignment is enable. 
*       		       - Transparency:
											0 : Font with background color.  
											1 : Font with background transparency. 
*                  - zoom:
											1 : X1. 
											2 : X2. 
											3 : X3.
											4 : X4.
*                  - turning :Whether can fill
											0 : Normal.  
											1 : 90 degree display.  
* Output         : None
* Return         : None
* Attention		   : None
*******************************************************************************/	
void LCD_External_Font_ROM(uint16_t x0, uint16_t y0,uint16_t Foreground_color,uint16_t Background_color,uint16_t Alignment,uint16_t Transparency, uint16_t zoom,uint16_t turning)
{
	Text_Mode();
		//*******set Font rom*******
//	CGROM_Font();
//	 Internal_CGROM();
	External_CGROM();//选择外部字库芯片
//		Font_size_16x16_8x16();
	Font_size_24x24_12x24();//字体大小选择//////////////////
//	Font_size_32x32_16x32();

//	GT_serial_ROM_select_GT21L16T1W();
//	GT_serial_ROM_select_GT23L16U2W();
	GT_serial_ROM_select_GT23L24T3Y();//选择GT23L24T3Y///////////////////////
//	GT_serial_ROM_select_GT23L24M1Z();
//	GT_serial_ROM_select_GT23L32S4W();

	/***********显示字码选择****************/
//	Font_code_GB2312();///////////////////////////////////
	//Font_code_GB12345();
//	Font_code_BIG5();
//	Font_code_UNICODE();
//	Font_code_ASCII();
	//Font_code_UNIJIS();
	//Font_code_JIS0208();
//	Font_code_LATIN();

	//Font_Standard();
	Font_Arial();////////////////////////////////
//	Font_Roman();
//	Font_Bold();
	/****************外置字符芯片设置*******************/
	Serial_ROM_select0();//选择SPI_FLASH ROM0
	//Serial_ROM_select1();
	
	Serial_ROM_Address_set_24bit();//24位寻址模式
	//Serial_ROM_Address_set_32bit();
	//Select_Serial_Waveform_mode0();
	Select_Serial_Waveform_mode3();//波形模式3

	//SERIAL_ROM_Read_Cycle_4bus();
	SERIAL_ROM_Read_Cycle_5bus();
	//SERIAL_ROM_Read_Cycle_6bus();

	SERIAL_ROM_Font_mode();
	//SERIAL_ROM_DMA_mode();

	SERIAL_ROM_Signal_mode();
//	SERIAL_ROM_Dual_mode0();
	//SERIAL_ROM_Dual_mode1();
	
	SROM_CLK_DIV(0x03);	//SFCL频率设定
//	Font_code_ASCII();
	Font_code_GB2312();	//////////////////////////////
	Font_Coordinate(x0,y0);
	
/******** Font foreground and background color Select   *******/		
	Text_Foreground_Color((Foreground_color&0xf800)>>11 ,(Foreground_color&0x07e0)>>5,(Foreground_color&0x001f));
	Text_Background_Color((Background_color&0xf800)>>11 ,(Background_color&0x07e0)>>5,(Background_color&0x001f));
	
/******************** Font Transparency  *********************/	
	if(Alignment) 
		No_FullAlignment();
	else 
		FullAlignment();	
	
/**************** Full Alignment Selection Bit   **************/	
	if(Transparency) 
		Font_with_BackgroundTransparency();
	else 
		Font_with_BackgroundColor();	
	
/**************** Enlargement, Transparent Font   ***************/	
	switch (zoom)
	{
		case 0:
		break;
		case 1:Horizontal_FontEnlarge_x1();
					 Vertical_FontEnlarge_x1();
			break;
		case 2:Horizontal_FontEnlarge_x2();
					 Vertical_FontEnlarge_x2();
			break;
		case 3:Horizontal_FontEnlarge_x3();
					 Vertical_FontEnlarge_x3();
		break;
		case 4:Horizontal_FontEnlarge_x4();
					 Vertical_FontEnlarge_x4();
		break;
		default:
			break;
	}
/*********************** 90 Degree Font  **********************/	
	if(turning) 
		Rotate90_Font();
	else 
		NoRotate_Font();
}
